--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\cyclical-migration\Table_1_Fig_1_2\table1_figs1and2.log
  log type:  text
 opened on:   2 Mar 2020, 10:52:17

. 
. *use table1, clear
. use Input\table1, clear

. 
. * the two series plotted in figure 1 are mv14_upsp (inter-county migration) and ds14_upsp (inter-state migration)
. * the figure was made in a program called Fame to get the NBER peak-trough shading
. l year  mv14_upsp ds14_upsp, nod noobs

  +----------------------------+
  | year   mv14~psp   ds14~psp |
  |----------------------------|
  | 1946          .          . |
  | 1947          .          . |
  | 1948   .0637126   .0321924 |
  | 1949   .0565002   .0298307 |
  | 1950   .0553001   .0267936 |
  |----------------------------|
  | 1951   .0674527    .033618 |
  | 1952   .0627431   .0332264 |
  | 1953   .0630298   .0348387 |
  | 1954   .0629925   .0324367 |
  | 1955   .0642184   .0306941 |
  |----------------------------|
  | 1956   .0665908   .0306832 |
  | 1957     .05926   .0287446 |
  | 1958   .0631934   .0309152 |
  | 1959   .0610242    .029038 |
  | 1960   .0621748   .0303102 |
  |----------------------------|
  | 1961   .0634679   .0319996 |
  | 1962    .058249   .0287898 |
  | 1963    .063536   .0325486 |
  | 1964   .0615753   .0294537 |
  | 1965   .0621243   .0287309 |
  |----------------------------|
  | 1966    .061082   .0298756 |
  | 1967   .0626596   .0302114 |
  | 1968   .0646007   .0321019 |
  | 1969   .0626776   .0313318 |
  | 1970   .0625517   .0321302 |
  |----------------------------|
  | 1971   .0614354   .0313004 |
  | 1972          .          . |
  | 1973          .          . |
  | 1974          .          . |
  | 1975          .          . |
  |----------------------------|
  | 1976   .0623907   .0281107 |
  | 1977          .          . |
  | 1978          .          . |
  | 1979          .          . |
  | 1980          .          . |
  |----------------------------|
  | 1981   .0603465   .0263431 |
  | 1982   .0607222   .0287732 |
  | 1983   .0584572   .0260704 |
  | 1984   .0623565   .0269976 |
  | 1985          .          . |
  |----------------------------|
  | 1986   .0653095     .02861 |
  | 1987   .0642681   .0275438 |
  | 1988   .0610887   .0284305 |
  | 1989   .0617352   .0285192 |
  | 1990   .0657876   .0319606 |
  |----------------------------|
  | 1991   .0607607   .0286216 |
  | 1992   .0586471   .0275622 |
  | 1993   .0573957   .0265973 |
  | 1994   .0562313   .0253507 |
  | 1995          .          . |
  |----------------------------|
  | 1996   .0519974   .0231857 |
  | 1997   .0494225   .0223882 |
  | 1998     .04887     .02244 |
  | 1999   .0498875   .0228513 |
  | 2000   .0521654   .0229236 |
  |----------------------------|
  | 2001   .0449602    .020089 |
  | 2002   .0447896   .0198051 |
  | 2003   .0409573   .0185871 |
  | 2004   .0407732   .0175964 |
  | 2005   .0398021   .0184086 |
  |----------------------------|
  | 2006   .0405917   .0169919 |
  | 2007   .0341897   .0142777 |
  | 2008    .032067   .0141807 |
  | 2009   .0313842   .0138334 |
  +----------------------------+

. 
. * regressions for Table 1
. for var  mv14_upspd: reg X gapusstd \ reg X05 gapusstd if year<=2005  \ reg X gapusstd sdgapstd \ reg X05 gapusstd  sdgapstd if year<=2005 

->  reg mv14_upspd gapusstd

      Source |       SS           df       MS      Number of obs   =        52
-------------+----------------------------------   F(1, 50)        =     11.09
       Model |  .000048162         1  .000048162   Prob > F        =    0.0016
    Residual |  .000217079        50  4.3416e-06   R-squared       =    0.1816
-------------+----------------------------------   Adj R-squared   =    0.1652
       Total |   .00026524        51  5.2008e-06   Root MSE        =    .00208

------------------------------------------------------------------------------
  mv14_upspd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gapusstd |   .0010031   .0003012     3.33   0.002     .0003982    .0016081
       _cons |   .0000138    .000289     0.05   0.962    -.0005666    .0005942
------------------------------------------------------------------------------

->  reg mv14_upspd05 gapusstd if year<=2005

      Source |       SS           df       MS      Number of obs   =        48
-------------+----------------------------------   F(1, 46)        =     12.48
       Model |  .000053491         1  .000053491   Prob > F        =    0.0009
    Residual |   .00019715        46  4.2859e-06   R-squared       =    0.2134
-------------+----------------------------------   Adj R-squared   =    0.1963
       Total |   .00025064        47  5.3328e-06   Root MSE        =    .00207

------------------------------------------------------------------------------
mv14_upspd05 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gapusstd |   .0011011   .0003117     3.53   0.001     .0004737    .0017284
       _cons |   .0000239   .0002989     0.08   0.937    -.0005778    .0006255
------------------------------------------------------------------------------

->  reg mv14_upspd gapusstd sdgapstd

      Source |       SS           df       MS      Number of obs   =        52
-------------+----------------------------------   F(2, 49)        =      5.44
       Model |  .000048165         2  .000024083   Prob > F        =    0.0074
    Residual |  .000217075        49  4.4301e-06   R-squared       =    0.1816
-------------+----------------------------------   Adj R-squared   =    0.1482
       Total |   .00026524        51  5.2008e-06   Root MSE        =     .0021

------------------------------------------------------------------------------
  mv14_upspd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gapusstd |   .0010018    .000308     3.25   0.002     .0003828    .0016208
    sdgapstd |  -7.97e-06   .0002834    -0.03   0.978    -.0005775    .0005615
       _cons |   .0000131   .0002928     0.04   0.964    -.0005754    .0006016
------------------------------------------------------------------------------

->  reg mv14_upspd05 gapusstd sdgapstd if year<=2005

      Source |       SS           df       MS      Number of obs   =        48
-------------+----------------------------------   F(2, 45)        =      6.16
       Model |  .000053841         2   .00002692   Prob > F        =    0.0043
    Residual |    .0001968        45  4.3733e-06   R-squared       =    0.2148
-------------+----------------------------------   Adj R-squared   =    0.1799
       Total |   .00025064        47  5.3328e-06   Root MSE        =    .00209

------------------------------------------------------------------------------
mv14_upspd05 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gapusstd |   .0010902   .0003172     3.44   0.001     .0004513     .001729
    sdgapstd |  -.0000848   .0002997    -0.28   0.779    -.0006885    .0005189
       _cons |   .0000249   .0003019     0.08   0.935    -.0005833     .000633
------------------------------------------------------------------------------

. for var  mv14_upspd: reg X ur12std if sdur~=. \ reg X05 ur12std if year<=2005 & sdur~=. \ reg X ur12std sdurstd \ reg X05 ur12std sdurstd if year<=2005

->  reg mv14_upspd ur12std if sdur~=.

      Source |       SS           df       MS      Number of obs   =        27
-------------+----------------------------------   F(1, 25)        =      2.10
       Model |  8.3405e-06         1  8.3405e-06   Prob > F        =    0.1602
    Residual |  .000099509        25  3.9804e-06   R-squared       =    0.0773
-------------+----------------------------------   Adj R-squared   =    0.0404
       Total |   .00010785        26  4.1481e-06   Root MSE        =      .002

------------------------------------------------------------------------------
  mv14_upspd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     ur12std |  -.0005558    .000384    -1.45   0.160    -.0013466     .000235
       _cons |   .0001435   .0004022     0.36   0.724    -.0006849    .0009719
------------------------------------------------------------------------------

->  reg mv14_upspd05 ur12std if year<=2005 & sdur~=.

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(1, 21)        =      2.48
       Model |  9.8554e-06         1  9.8554e-06   Prob > F        =    0.1301
    Residual |  .000083382        21  3.9706e-06   R-squared       =    0.1057
-------------+----------------------------------   Adj R-squared   =    0.0631
       Total |  .000093238        22  4.2381e-06   Root MSE        =    .00199

------------------------------------------------------------------------------
mv14_upspd05 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     ur12std |  -.0006402   .0004063    -1.58   0.130    -.0014852    .0002049
       _cons |   .0002306   .0004484     0.51   0.612     -.000702    .0011632
------------------------------------------------------------------------------

->  reg mv14_upspd ur12std sdurstd

      Source |       SS           df       MS      Number of obs   =        27
-------------+----------------------------------   F(2, 24)        =      1.66
       Model |  .000013072         2  6.5359e-06   Prob > F        =    0.2122
    Residual |  .000094778        24  3.9491e-06   R-squared       =    0.1212
-------------+----------------------------------   Adj R-squared   =    0.0480
       Total |   .00010785        26  4.1481e-06   Root MSE        =    .00199

------------------------------------------------------------------------------
  mv14_upspd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     ur12std |   -.001207   .0007073    -1.71   0.101    -.0026668    .0002527
     sdurstd |   .0007528   .0006878     1.09   0.285    -.0006667    .0021723
       _cons |   .0003836   .0004568     0.84   0.409    -.0005592    .0013263
------------------------------------------------------------------------------

->  reg mv14_upspd05 ur12std sdurstd if year<=2005

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(2, 20)        =      1.95
       Model |  .000015233         2  7.6166e-06   Prob > F        =    0.1680
    Residual |  .000078004        20  3.9002e-06   R-squared       =    0.1634
-------------+----------------------------------   Adj R-squared   =    0.0797
       Total |  .000093238        22  4.2381e-06   Root MSE        =    .00197

------------------------------------------------------------------------------
mv14_upspd05 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     ur12std |  -.0013251   .0007088    -1.87   0.076    -.0028037    .0001535
     sdurstd |   .0008081   .0006882     1.17   0.254    -.0006274    .0022437
       _cons |   .0004623   .0004863     0.95   0.353    -.0005521    .0014767
------------------------------------------------------------------------------

. for var  mv14_upspd: reg X urateus1std \ reg X05 urateus1std if year<=2005\ reg X urateus1std sdurate1std \ reg X05 urateus1std sdurate1std if year<=2005 

->  reg mv14_upspd urateus1std

      Source |       SS           df       MS      Number of obs   =        52
-------------+----------------------------------   F(1, 50)        =      2.83
       Model |  .000014209         1  .000014209   Prob > F        =    0.0987
    Residual |  .000251031        50  5.0206e-06   R-squared       =    0.0536
-------------+----------------------------------   Adj R-squared   =    0.0346
       Total |   .00026524        51  5.2008e-06   Root MSE        =    .00224

------------------------------------------------------------------------------
  mv14_upspd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 urateus1std |  -.0004911   .0002919    -1.68   0.099    -.0010774    .0000952
       _cons |   6.89e-07   .0003107     0.00   0.998    -.0006234    .0006248
------------------------------------------------------------------------------

->  reg mv14_upspd05 urateus1std if year<=2005

      Source |       SS           df       MS      Number of obs   =        48
-------------+----------------------------------   F(1, 46)        =      3.16
       Model |  .000016119         1  .000016119   Prob > F        =    0.0820
    Residual |  .000234521        46  5.0983e-06   R-squared       =    0.0643
-------------+----------------------------------   Adj R-squared   =    0.0440
       Total |   .00025064        47  5.3328e-06   Root MSE        =    .00226

------------------------------------------------------------------------------
mv14_upspd05 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 urateus1std |  -.0005492   .0003089    -1.78   0.082     -.001171    .0000725
       _cons |   .0000507   .0003272     0.15   0.878    -.0006078    .0007092
------------------------------------------------------------------------------

->  reg mv14_upspd urateus1std sdurate1std

      Source |       SS           df       MS      Number of obs   =        52
-------------+----------------------------------   F(2, 49)        =      1.57
       Model |  .000015956         2  7.9781e-06   Prob > F        =    0.2187
    Residual |  .000249284        49  5.0874e-06   R-squared       =    0.0602
-------------+----------------------------------   Adj R-squared   =    0.0218
       Total |   .00026524        51  5.2008e-06   Root MSE        =    .00226

------------------------------------------------------------------------------
  mv14_upspd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 urateus1std |  -.0007153   .0004824    -1.48   0.145    -.0016847    .0002541
 sdurate1std |   .0002881   .0004916     0.59   0.561    -.0006998    .0012759
       _cons |   .0000228   .0003151     0.07   0.943    -.0006103     .000656
------------------------------------------------------------------------------

->  reg mv14_upspd05 urateus1std sdurate1std if year<=2005

      Source |       SS           df       MS      Number of obs   =        48
-------------+----------------------------------   F(2, 45)        =      1.67
       Model |  .000017313         2  8.6565e-06   Prob > F        =    0.1998
    Residual |  .000233327        45  5.1850e-06   R-squared       =    0.0691
-------------+----------------------------------   Adj R-squared   =    0.0277
       Total |   .00025064        47  5.3328e-06   Root MSE        =    .00228

------------------------------------------------------------------------------
mv14_upspd05 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 urateus1std |  -.0007342   .0004956    -1.48   0.145    -.0017323     .000264
 sdurate1std |   .0002395    .000499     0.48   0.634    -.0007657    .0012446
       _cons |    .000067   .0003317     0.20   0.841     -.000601     .000735
------------------------------------------------------------------------------

. 
. 
. * regression lines for Figure 2
. for var  mv14_upspd: reg X gapus \ quietly predict Xfit if e(sample), xb 

->  reg mv14_upspd gapus

      Source |       SS           df       MS      Number of obs   =        52
-------------+----------------------------------   F(1, 50)        =     11.09
       Model |  .000048162         1  .000048162   Prob > F        =    0.0016
    Residual |  .000217079        50  4.3416e-06   R-squared       =    0.1816
-------------+----------------------------------   Adj R-squared   =    0.1652
       Total |   .00026524        51  5.2008e-06   Root MSE        =    .00208

------------------------------------------------------------------------------
  mv14_upspd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       gapus |    .047113   .0141453     3.33   0.002     .0187012    .0755247
       _cons |   .0000851   .0002901     0.29   0.771    -.0004976    .0006677
------------------------------------------------------------------------------

->  quietly predict mv14_upspdfit if e(sample), xb

. for var  mv14_upspd: reg X ur12 \ quietly predict Xfit2 if e(sample), xb 

->  reg mv14_upspd ur12

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(1, 49)        =      2.66
       Model |  .000013173         1  .000013173   Prob > F        =    0.1090
    Residual |  .000242265        49  4.9442e-06   R-squared       =    0.0516
-------------+----------------------------------   Adj R-squared   =    0.0322
       Total |  .000255438        50  5.1088e-06   Root MSE        =    .00222

------------------------------------------------------------------------------
  mv14_upspd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ur12 |  -.0338634    .020746    -1.63   0.109     -.075554    .0078272
       _cons |   .0018008   .0011822     1.52   0.134     -.000575    .0041766
------------------------------------------------------------------------------

->  quietly predict mv14_upspdfit2 if e(sample), xb

. for var  mv14_upspd: reg X urateus1 \ quietly predict Xfit3 if e(sample), xb 

->  reg mv14_upspd urateus1

      Source |       SS           df       MS      Number of obs   =        52
-------------+----------------------------------   F(1, 50)        =      2.83
       Model |  .000014209         1  .000014209   Prob > F        =    0.0987
    Residual |  .000251031        50  5.0206e-06   R-squared       =    0.0536
-------------+----------------------------------   Adj R-squared   =    0.0346
       Total |   .00026524        51  5.2008e-06   Root MSE        =    .00224

------------------------------------------------------------------------------
  mv14_upspd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    urateus1 |  -.0139085   .0082675    -1.68   0.099    -.0305142    .0026973
       _cons |   .0016118   .0010072     1.60   0.116    -.0004113     .003635
------------------------------------------------------------------------------

->  quietly predict mv14_upspdfit3 if e(sample), xb

. 
. * top panel of Figure 2
. sort gapus

. gr7 mv14_upspd mv14_upspdfit gapus, c(.l) s([year].)   ylab(-.006(.002).008) xlab(-.05(.01).04) b2("Ln(US Employment/Trend Employment)") b1("") l1("Detrended Migration 14+") l2("(Fraction of Populat
> ion 14+)") key1("") saving(Output\g1, replace)

. * middle panel of Figure 2
. replace ur12 = ur12*100
(61 real changes made)

. sort ur12

. gr7 mv14_upspd mv14_upspdfit2 ur12, c(.l) s([year].)   ylab(-.006(.002).008) xlab(3(1)10) b2("Unemployment Rate") b1("") l1("Detrended Migration 14+") l2("(Fraction of Population 14+)") key1("") sav
> ing(Output\g2, replace)

. * bottom panel of Figure 2
. replace urateus1 = urateus1*100
(63 real changes made)

. sort urateus1

. gr7 mv14_upspd mv14_upspdfit3 urateus1, c(.l) s([year].)   ylab(-.006(.002).008) xlab(6(3)24) b2("UI Claims Rate") b1("") l1("Detrended Migration 14+") l2("(Fraction of Population 14+)") key1("") sa
> ving(Output\g3, replace)

. * Appendix Figure 1
. gen gapus100 = gapus*100

. sort year

. *twoway line gapus100 ur12 urateus1 year if year>=1948, legend(lab(1 "Employment Gap") lab(2 "Unemployment Rate") lab(3 "UI Claims Rate")) xlab(1950(10)2010) ylab(-5(5)25, nogrid) ysca(r(-5 25)) lpa
> ttern(solid dash shortdash) lcolor(black black black) graphregion(color(white))
. twoway line gapus100 ur12 urateus1 year if year>=1948, legend(lab(1 "Employment Gap") lab(2 "Unemployment Rate") lab(3 "UI Claims Rate")) xlab(1950(10)2010) ylab(-5(5)25, nogrid) ysca(r(-5 25)) lpat
> tern(solid dash shortdash) lcolor(black black black) graphregion(color(white)) saving(Output\A1, replace)
(file Output\A1.gph saved)

. 
. quietly log off
