------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Tables 1-4 Public Programs and Data\tables 5 and 6\makestatecycle_ipums5.log
  log type:  text
 opened on:  10 Dec 2019, 10:11:44

. 
. ** merge IPUMS cps state codes by abbreviation to state level BC data
. ** merge the above with annual national BC data
. 
. ** now the state level BC data will have correct codes in each year for merging
. ** with IPUMS cps -- note that prior to 1977, some states not uniquely identified
. ** annual state BC data is now also linked to annual national BC data
. 
. ** merge with new dataset from raven
. ** add change in national and state ur to data set
. 
. ** program starts with a state emp data set, merges in cps state codes for 1963 to 2005 saves as stateccyle_ipum
> s
. ** second part of program creates variables in statecycle_ipums for merging with march cps data
. 
. ** keep nondetrended urates 
. 
. ** added bartik and oil price shocks developed by raven 
. 
. set mem 100m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly
    automatically.

. 
. 
. use ipumscps_statecodes.dta

. sort abbrev

. save ipumscps_statecodes.dta, replace 
file ipumscps_statecodes.dta saved

. clear

. 
. /*
> * Not using vars from cycle anymore - 2/16/2010
> use cycle.dta
> sort year 
> tempfile tempcycle
> save tempcycle, replace
> clear
> */
. 
. use bartik_s10.dta

. sort year state

. save bartik_s10.dta, replace
file bartik_s10.dta saved

. clear

. 
. 
. use stateemp3

. 
. summ

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         lat |      3,528    39.39469    4.332804       30.3      46.97
         lon |      3,528    90.98816    15.13095       69.8        123
       state |      3,672    28.96078    15.67897          1         56
       dist1 |      3,528    876.4519    513.7288          0   2184.004
       dist4 |      3,528    1348.644    571.1334          0     2360.8
-------------+---------------------------------------------------------
       dist5 |      3,528    801.8498    422.2364          0   1809.896
       dist6 |      3,528    1674.285    740.4168          0   2769.255
       dist8 |      3,528    1021.322    481.0604          0   1885.345
       dist9 |      3,528    1057.801     764.484          0   2687.751
      dist10 |      3,528    943.6832     720.366          0   2571.503
-------------+---------------------------------------------------------
      dist11 |      3,528    895.4617     691.906          0   2494.503
      dist12 |      3,528    977.4713     536.869          0   2341.857
      dist13 |      3,528    846.5679    542.8661          0   2237.515
      dist16 |      3,528    1461.924    683.3946          0   2460.806
      dist17 |      3,528    745.3079    427.7586          0   1828.619
-------------+---------------------------------------------------------
      dist18 |      3,528    748.2479    485.5915          0   2004.814
      dist19 |      3,528    791.9457    383.5054          0   1595.174
      dist20 |      3,528    800.4283    390.7226          0   1545.461
      dist21 |      3,528     755.809    520.3149          0    2101.14
      dist22 |      3,528    949.3716    454.5134          0   2030.308
-------------+---------------------------------------------------------
      dist23 |      3,528    1228.832    774.3244          0   2820.251
      dist24 |      3,528     904.941    699.8945          0   2508.623
      dist25 |      3,528    1132.453    781.9427          0   2767.425
      dist26 |      3,528    811.4658    493.1132          0   2050.542
      dist27 |      3,528    871.8275    361.5697          0   1588.318
-------------+---------------------------------------------------------
      dist28 |      3,528    871.3257    463.3502          0   2012.586
      dist29 |      3,528    757.3299    407.4019          0   1728.335
      dist30 |      3,528    1366.233    595.0654          0   2242.142
      dist31 |      3,528    828.8153    386.0236          0   1449.033
      dist32 |      3,528    1590.796     728.483          0   2669.796
-------------+---------------------------------------------------------
      dist33 |      3,528    1128.033    772.1505          0   2736.628
      dist34 |      3,528    967.2147    731.5928          0   2589.832
      dist35 |      3,528    1095.479    490.2581          0   2014.626
      dist36 |      3,528    1034.101    739.5647          0   2618.587
      dist37 |      3,528    891.8226    644.4224          0   2460.941
-------------+---------------------------------------------------------
      dist38 |      3,528    1049.634    397.8178          0   1649.063
      dist39 |      3,528    782.0385    554.4921          0   2175.054
      dist40 |      3,528    877.3152    402.3635          0   1597.129
      dist41 |      3,528    1780.419    766.2417          0   2819.905
      dist42 |      3,528    903.8546    693.1514          0   2484.819
-------------+---------------------------------------------------------
      dist44 |      3,528    1107.298    779.1957          0   2751.835
      dist45 |      3,528    890.1186    596.1698          0   2390.132
      dist46 |      3,528     965.106    402.9258          0   1615.445
      dist47 |      3,528    767.9455    496.1929          0   2060.873
      dist48 |      3,528    1039.868    415.6267          0   1767.793
-------------+---------------------------------------------------------
      dist49 |      3,528    1268.358    608.0315          0   2248.356
      dist50 |      3,528    1113.832    745.1331          0   2674.348
      dist51 |      3,528    900.7542    680.0432          0   2502.289
      dist53 |      3,528    1815.924    754.7936          0   2820.251
      dist54 |      3,528     797.865    590.4586          0   2268.133
-------------+---------------------------------------------------------
      dist55 |      3,528    800.3707     407.844          0   1798.887
      dist56 |      3,528    1026.804    480.0067          0   1868.941
        year |      3,670    1973.481    20.77456       1938       2009
         inc |      2,040    18201.16    11206.95       2403      66119
       incus |      2,040     18787.7    10941.76       3836      40208
-------------+---------------------------------------------------------
        rinc |      2,040   -.0457383    .1517307  -.4677122   .5838141
      uratet |      3,570    .1149943     .047315   .0135061   .3952213
       urate |      3,522     .114802     .062682   .0007409   .6041837
      urated |      3,522    6.04e-10    .0357701  -.1861619   .3240443
     urateus |      3,570     .112969    .0409248   .0177543   .2323321
-------------+---------------------------------------------------------
    uratetus |      3,570     .112969    .0227483   .0808968   .1525226
    uratedus |      3,570    2.55e-09     .032104    -.08611   .1311143
      rurate |      3,522     .000601     .049465  -.1639377   .4707959
     rurated |      3,522   -.0009607     .022693  -.1328874   .2424239
    medval05 |      3,481    175502.5    86779.09      82700     477700
-------------+---------------------------------------------------------
      abbrev |          0
       hpius |      1,666     85.6781    46.85268    22.5764   195.7144
      ee_rst |      3,443    1633.208    1987.151       32.3    15152.2
        ur12 |      2,989    .0561448      .01435   .0293333   .1009167
        eeus |      3,479    81344.48    32817.19      30280     137858
-------------+---------------------------------------------------------
       eetus |      3,479    81344.48    32746.41   32334.27   136773.8
     ruc_rst |      1,617    .0582509    .0195626     .02275   .1665833
     eet_rst |      3,479    1636.485    1977.443   36.67463    15057.1
         hpi |      1,666    83.96232    41.83461    17.9036   271.9248
    c1ee_rst |      3,394     .024253    .0386514  -.1439446   .3962767
-------------+---------------------------------------------------------
      c1eeus |      3,430    .0217041    .0301483  -.0419852   .1094774
       hpi05 |      3,479    152.5871    29.47607   118.7637   237.5531
          hp |      1,666    93708.68    63313.29   16734.77   546818.7
        hpus |      1,666    41034.75    22439.67   10812.76   93735.63
         lhp |      1,666    11.26892     .586532   9.725244   13.21187
-------------+---------------------------------------------------------
       lhpus |      1,666    10.47204    .5593164   9.288483   11.44823
      dlhpus |      1,617    .0530056    .0784484  -.2474909    .167347
        dlhp |      1,617    .0485264    .0708433  -.3563633   .2857075
 p10c1ee_rst |      3,430   -.0026194     .027481  -.0957447   .0438394
 p90c1ee_rst |      3,430    .0521752    .0361758  -.0096703   .1998307
-------------+---------------------------------------------------------
  p9010c1emp |      3,430    .0547946    .0291782   .0210598   .1897296
         gap |      3,443   -.0009445    .0349331  -.1532079   .2397948
       gapus |      3,479   -.0005613    .0269461  -.0663123   .0941144
        rgap |      3,443   -.0003789    .0239706  -.1424526   .1511222
        rruc |      1,617    -.003345     .014784    -.04575   .0768333
-------------+---------------------------------------------------------
        rlhp |      1,666    .7968856    .3419874  -.1223097   1.763638
       rdlhp |      1,617   -.0044792    .0580492  -.1781759   .2782669
         pce |      1,715    72.52429    22.36135      31.46     108.45
        pce1 |      1,666    71.46765    21.80929      31.46     107.97
     rdlhpus |      1,617    .0172713    .0736648  -.2519267   .1332943
-------------+---------------------------------------------------------
          ur |      1,617    .0582509    .0195626     .02275   .1665833
      p10gap |      3,619   -.0278736    .0273356  -.1205285   .0168136
       p10ur |      1,681    .0393312    .0086128   .0276667      .0695
   p10urated |      3,570   -.0178664    .0309166    -.12881   .0747824
    p10urate |      3,570    .0690844       .0354   .0056314   .2510797
-------------+---------------------------------------------------------
      p25gap |      3,619   -.0145157    .0263467  -.1030273   .0535361
       p25ur |      1,681    .0484904    .0108847   .0315833   .0803333
   p25urated |      3,570   -.0095064     .028464  -.1011308   .0805588
    p25urate |      3,570    .0855982    .0396019   .0081758   .2726566
      p75gap |      3,619    .0113937    .0282237  -.0423817   .1429196
-------------+---------------------------------------------------------
       p75ur |      1,681    .0671145    .0159457     .04425   .1106667
   p75urated |      3,570    .0111879    .0345345  -.0675555    .150157
    p75urate |      3,570    .1431561    .0597404    .020829   .4477757
      p90gap |      3,619    .0262185    .0294656  -.0169712   .1632139
       p90ur |      1,681    .0756882    .0170389   .0514167   .1228333
-------------+---------------------------------------------------------
   p90urated |      3,570    .0211357    .0380626  -.0536315   .1706473
    p90urate |      3,570    .1668886    .0643892   .0255922   .4533716
    p9010gap |      3,619    .0540921     .025764   .0180177   .1533077
    p7525gap |      3,619    .0259094    .0149727   .0084936   .0893835
       sdgap |      3,619    .0217096    .0099992   .0067782   .0631928
-------------+---------------------------------------------------------
     p9010ur |      1,681     .036357    .0104216     .02375   .0569167
     p7525ur |      1,681    .0186241    .0063938   .0104167      .0305
        sdur |      1,681    .0141506    .0044368   .0086605   .0236502
 p9010urated |      3,570    .0390021     .022449   .0102057   .1073365
 p7525urated |      3,570    .0206943    .0131199   .0053706   .0695982
-------------+---------------------------------------------------------
    sdurated |      3,570    .0183711    .0109705   .0049283   .0553466
  p9010urate |      3,570    .0978042    .0364989   .0199608   .2315579
  p7525urate |      3,570    .0575579    .0237939   .0126532   .1751191
     sdurate |      3,570    .0461505    .0169279   .0087901   .1027301
      gappos |      3,672     23.1378    16.53676          0         49
-------------+---------------------------------------------------------
        ngap |      3,672    47.79276        5.87          0         49
     gapposs |      3,619    .4841193    .3385999          0          1
     c1eepos |      3,672    37.17892    14.81523          0         49
       nc1ee |      3,672     47.1122    8.105941          0         49
    c1eeposs |      3,568    .7884414    .2782845   .0612245          1
-------------+---------------------------------------------------------
      rgapx2 |      3,479   -.0003803    .0049912  -.0148697   .0093639
       rgapx |      3,672   -.0003515        .007  -.0282374   .0322613
        gapx |      3,672   -.0008822    .0254844  -.0846998   .1226182
    ruratedx |      3,672   -.0008983    .0077743  -.0471272   .0653785
     ruratex |      3,672   -.0020183    .0117641  -.0540926    .097428
-------------+---------------------------------------------------------
       rrucx |      3,672   -.0015166    .0030159   -.018206   .0062761
       c1eex |      3,672    .0214915    .0287928  -.0429302   .1660637
       rlhpx |      3,672    .3672046    .4129948          0    1.18891
      rdlhpx |      3,672   -.0020405    .0241199  -.1036335   .1373355
       rincx |      3,672   -.0234295    .0403634  -.1500938   .1141917
-------------+---------------------------------------------------------
      rgapx3 |      3,443    6.82e-12    .0239506  -.1539243   .1509875
    urateus1 |      3,570     .112969    .0409248   .0177543   .2323321
   uratedus1 |      3,570    2.55e-09     .032104    -.08611   .1311143
     rurate1 |      3,522     .000601     .049465  -.1639377   .4707959
    rurate11 |      3,471     .000651    .0496742  -.1639377   .4707959
-------------+---------------------------------------------------------
    ruratex1 |      3,621   -.0020468    .0118442  -.0540926    .097428
    rurated1 |      3,522   -.0009607     .022693  -.1328874   .2424239
   rurated11 |      3,471   -.0009573    .0228298  -.1328874   .2424239
       rgap1 |      3,394   -.0004908    .0240404  -.1424526   .1511222
       rruc1 |      1,568   -.0032875    .0147816    -.04575   .0768333
-------------+---------------------------------------------------------
      lhpus1 |      1,617     10.4549    .5588609   9.288483   11.44823
       rlhp1 |      1,617    .7962536    .3407713  -.1223097   1.763638
      rlhpx1 |      3,621    .3611268    .4119438          0    1.18891
     dlhpus1 |      1,568    .0623961    .0586066  -.1367617    .167347
      rdlhp1 |      1,568   -.0081518    .0530541  -.1781759   .2086897
-------------+---------------------------------------------------------
     rdlhpx1 |      3,621   -.0036535    .0197957  -.1036335   .1028045
        inc1 |      2,040    18201.16    11206.95       2403      66119
       rinc1 |      2,040   -.0457383    .1517307  -.4677122   .5838141
      incus1 |      2,040     18787.7    10941.76       3836      40208
      rincx1 |      3,621   -.0237595    .0405502  -.1500938   .1141917
-------------+---------------------------------------------------------
      rinc11 |      1,989   -.0462317    .1515563  -.4677122   .5838141
      rlhp11 |      1,568    .7991147    .3375957  -.1223097   1.763638

. 
. * merge in bartik shocks which are in a state-year dataset for 1969 to 2006
. 
. sort year state

. 
. merge year state using bartik_s10
(note: you are using old merge syntax; see [D] merge for new syntax)

. tab1 _merge

-> tabulation of _merge  

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,632       43.97       43.97
          2 |         40        1.08       45.04
          3 |      2,040       54.96      100.00
------------+-----------------------------------
      Total |      3,712      100.00

. tab1 year if _merge < 3

-> tabulation of year if _merge < 3 

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1938 |         51        3.05        3.05
       1939 |         51        3.05        6.11
       1940 |         51        3.05        9.16
       1941 |         51        3.05       12.22
       1942 |         51        3.05       15.27
       1943 |         51        3.05       18.32
       1944 |         51        3.05       21.38
       1945 |         51        3.05       24.43
       1946 |         51        3.05       27.49
       1947 |         51        3.05       30.54
       1948 |         51        3.05       33.59
       1949 |         51        3.05       36.65
       1950 |         51        3.05       39.70
       1951 |         51        3.05       42.75
       1952 |         51        3.05       45.81
       1953 |         51        3.05       48.86
       1954 |         51        3.05       51.92
       1955 |         51        3.05       54.97
       1956 |         51        3.05       58.02
       1957 |         51        3.05       61.08
       1958 |         51        3.05       64.13
       1959 |         51        3.05       67.19
       1960 |         51        3.05       70.24
       1961 |         51        3.05       73.29
       1962 |         51        3.05       76.35
       1963 |         51        3.05       79.40
       1964 |         51        3.05       82.46
       1965 |         51        3.05       85.51
       1966 |         51        3.05       88.56
       1967 |         51        3.05       91.62
       1968 |         51        3.05       94.67
       1969 |          1        0.06       94.73
       1970 |          1        0.06       94.79
       1971 |          1        0.06       94.85
       1972 |          1        0.06       94.91
       1973 |          1        0.06       94.97
       1974 |          1        0.06       95.03
       1975 |          1        0.06       95.09
       1976 |          1        0.06       95.15
       1977 |          1        0.06       95.21
       1978 |          1        0.06       95.27
       1979 |          1        0.06       95.33
       1980 |          1        0.06       95.39
       1981 |          1        0.06       95.45
       1982 |          1        0.06       95.51
       1983 |          1        0.06       95.57
       1984 |          1        0.06       95.63
       1985 |          1        0.06       95.69
       1986 |          1        0.06       95.75
       1987 |          1        0.06       95.81
       1988 |          1        0.06       95.87
       1989 |          1        0.06       95.93
       1990 |          1        0.06       95.99
       1991 |          1        0.06       96.05
       1992 |          1        0.06       96.11
       1993 |          1        0.06       96.17
       1994 |          1        0.06       96.23
       1995 |          1        0.06       96.29
       1996 |          1        0.06       96.35
       1997 |          1        0.06       96.41
       1998 |          1        0.06       96.47
       1999 |          1        0.06       96.53
       2000 |          1        0.06       96.59
       2001 |          1        0.06       96.65
       2002 |          1        0.06       96.71
       2003 |          1        0.06       96.77
       2004 |          1        0.06       96.83
       2005 |          1        0.06       96.89
       2006 |          1        0.06       96.95
       2007 |          1        0.06       97.01
       2008 |          1        0.06       97.07
       2009 |         49        2.93      100.00
------------+-----------------------------------
      Total |      1,670      100.00

. tab1 year state if _merge==1

-> tabulation of year if _merge==1 

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1938 |         51        3.13        3.13
       1939 |         51        3.13        6.26
       1940 |         51        3.13        9.39
       1941 |         51        3.13       12.52
       1942 |         51        3.13       15.64
       1943 |         51        3.13       18.77
       1944 |         51        3.13       21.90
       1945 |         51        3.13       25.03
       1946 |         51        3.13       28.16
       1947 |         51        3.13       31.29
       1948 |         51        3.13       34.42
       1949 |         51        3.13       37.55
       1950 |         51        3.13       40.67
       1951 |         51        3.13       43.80
       1952 |         51        3.13       46.93
       1953 |         51        3.13       50.06
       1954 |         51        3.13       53.19
       1955 |         51        3.13       56.32
       1956 |         51        3.13       59.45
       1957 |         51        3.13       62.58
       1958 |         51        3.13       65.71
       1959 |         51        3.13       68.83
       1960 |         51        3.13       71.96
       1961 |         51        3.13       75.09
       1962 |         51        3.13       78.22
       1963 |         51        3.13       81.35
       1964 |         51        3.13       84.48
       1965 |         51        3.13       87.61
       1966 |         51        3.13       90.74
       1967 |         51        3.13       93.87
       1968 |         51        3.13       96.99
       2009 |         49        3.01      100.00
------------+-----------------------------------
      Total |      1,630      100.00

-> tabulation of state if _merge==1 

      state |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         32        1.96        1.96
          2 |         32        1.96        3.92
          4 |         32        1.96        5.88
          5 |         32        1.96        7.84
          6 |         32        1.96        9.80
          8 |         32        1.96       11.76
          9 |         32        1.96       13.73
         10 |         32        1.96       15.69
         11 |         32        1.96       17.65
         12 |         32        1.96       19.61
         13 |         32        1.96       21.57
         15 |         32        1.96       23.53
         16 |         32        1.96       25.49
         17 |         32        1.96       27.45
         18 |         32        1.96       29.41
         19 |         32        1.96       31.37
         20 |         32        1.96       33.33
         21 |         32        1.96       35.29
         22 |         32        1.96       37.25
         23 |         32        1.96       39.22
         24 |         32        1.96       41.18
         25 |         32        1.96       43.14
         26 |         32        1.96       45.10
         27 |         32        1.96       47.06
         28 |         32        1.96       49.02
         29 |         32        1.96       50.98
         30 |         32        1.96       52.94
         31 |         32        1.96       54.90
         32 |         32        1.96       56.86
         33 |         32        1.96       58.82
         34 |         32        1.96       60.78
         35 |         32        1.96       62.75
         36 |         32        1.96       64.71
         37 |         32        1.96       66.67
         38 |         32        1.96       68.63
         39 |         32        1.96       70.59
         40 |         32        1.96       72.55
         41 |         32        1.96       74.51
         42 |         32        1.96       76.47
         44 |         32        1.96       78.43
         45 |         32        1.96       80.39
         46 |         32        1.96       82.35
         47 |         32        1.96       84.31
         48 |         32        1.96       86.27
         49 |         32        1.96       88.24
         50 |         32        1.96       90.20
         51 |         32        1.96       92.16
         53 |         32        1.96       94.12
         54 |         32        1.96       96.08
         55 |         32        1.96       98.04
         56 |         32        1.96      100.00
------------+-----------------------------------
      Total |      1,632      100.00

. tab1 year state if _merge==2

-> tabulation of year if _merge==2 

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1969 |          1        2.50        2.50
       1970 |          1        2.50        5.00
       1971 |          1        2.50        7.50
       1972 |          1        2.50       10.00
       1973 |          1        2.50       12.50
       1974 |          1        2.50       15.00
       1975 |          1        2.50       17.50
       1976 |          1        2.50       20.00
       1977 |          1        2.50       22.50
       1978 |          1        2.50       25.00
       1979 |          1        2.50       27.50
       1980 |          1        2.50       30.00
       1981 |          1        2.50       32.50
       1982 |          1        2.50       35.00
       1983 |          1        2.50       37.50
       1984 |          1        2.50       40.00
       1985 |          1        2.50       42.50
       1986 |          1        2.50       45.00
       1987 |          1        2.50       47.50
       1988 |          1        2.50       50.00
       1989 |          1        2.50       52.50
       1990 |          1        2.50       55.00
       1991 |          1        2.50       57.50
       1992 |          1        2.50       60.00
       1993 |          1        2.50       62.50
       1994 |          1        2.50       65.00
       1995 |          1        2.50       67.50
       1996 |          1        2.50       70.00
       1997 |          1        2.50       72.50
       1998 |          1        2.50       75.00
       1999 |          1        2.50       77.50
       2000 |          1        2.50       80.00
       2001 |          1        2.50       82.50
       2002 |          1        2.50       85.00
       2003 |          1        2.50       87.50
       2004 |          1        2.50       90.00
       2005 |          1        2.50       92.50
       2006 |          1        2.50       95.00
       2007 |          1        2.50       97.50
       2008 |          1        2.50      100.00
------------+-----------------------------------
      Total |         40      100.00

-> tabulation of state if _merge==2 

      state |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         40      100.00      100.00
------------+-----------------------------------
      Total |         40      100.00

. tab1 year state if _merge==3

-> tabulation of year if _merge==3 

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1969 |         51        2.50        2.50
       1970 |         51        2.50        5.00
       1971 |         51        2.50        7.50
       1972 |         51        2.50       10.00
       1973 |         51        2.50       12.50
       1974 |         51        2.50       15.00
       1975 |         51        2.50       17.50
       1976 |         51        2.50       20.00
       1977 |         51        2.50       22.50
       1978 |         51        2.50       25.00
       1979 |         51        2.50       27.50
       1980 |         51        2.50       30.00
       1981 |         51        2.50       32.50
       1982 |         51        2.50       35.00
       1983 |         51        2.50       37.50
       1984 |         51        2.50       40.00
       1985 |         51        2.50       42.50
       1986 |         51        2.50       45.00
       1987 |         51        2.50       47.50
       1988 |         51        2.50       50.00
       1989 |         51        2.50       52.50
       1990 |         51        2.50       55.00
       1991 |         51        2.50       57.50
       1992 |         51        2.50       60.00
       1993 |         51        2.50       62.50
       1994 |         51        2.50       65.00
       1995 |         51        2.50       67.50
       1996 |         51        2.50       70.00
       1997 |         51        2.50       72.50
       1998 |         51        2.50       75.00
       1999 |         51        2.50       77.50
       2000 |         51        2.50       80.00
       2001 |         51        2.50       82.50
       2002 |         51        2.50       85.00
       2003 |         51        2.50       87.50
       2004 |         51        2.50       90.00
       2005 |         51        2.50       92.50
       2006 |         51        2.50       95.00
       2007 |         51        2.50       97.50
       2008 |         51        2.50      100.00
------------+-----------------------------------
      Total |      2,040      100.00

-> tabulation of state if _merge==3 

      state |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         40        1.96        1.96
          2 |         40        1.96        3.92
          4 |         40        1.96        5.88
          5 |         40        1.96        7.84
          6 |         40        1.96        9.80
          8 |         40        1.96       11.76
          9 |         40        1.96       13.73
         10 |         40        1.96       15.69
         11 |         40        1.96       17.65
         12 |         40        1.96       19.61
         13 |         40        1.96       21.57
         15 |         40        1.96       23.53
         16 |         40        1.96       25.49
         17 |         40        1.96       27.45
         18 |         40        1.96       29.41
         19 |         40        1.96       31.37
         20 |         40        1.96       33.33
         21 |         40        1.96       35.29
         22 |         40        1.96       37.25
         23 |         40        1.96       39.22
         24 |         40        1.96       41.18
         25 |         40        1.96       43.14
         26 |         40        1.96       45.10
         27 |         40        1.96       47.06
         28 |         40        1.96       49.02
         29 |         40        1.96       50.98
         30 |         40        1.96       52.94
         31 |         40        1.96       54.90
         32 |         40        1.96       56.86
         33 |         40        1.96       58.82
         34 |         40        1.96       60.78
         35 |         40        1.96       62.75
         36 |         40        1.96       64.71
         37 |         40        1.96       66.67
         38 |         40        1.96       68.63
         39 |         40        1.96       70.59
         40 |         40        1.96       72.55
         41 |         40        1.96       74.51
         42 |         40        1.96       76.47
         44 |         40        1.96       78.43
         45 |         40        1.96       80.39
         46 |         40        1.96       82.35
         47 |         40        1.96       84.31
         48 |         40        1.96       86.27
         49 |         40        1.96       88.24
         50 |         40        1.96       90.20
         51 |         40        1.96       92.16
         53 |         40        1.96       94.12
         54 |         40        1.96       96.08
         55 |         40        1.96       98.04
         56 |         40        1.96      100.00
------------+-----------------------------------
      Total |      2,040      100.00

. 
. drop _merge

. 
. rename state xstatefip

. sort year xstatefip

. preserve

. 
. * push UI claims back one year to match april to march pattern of cps
. * so for example 1970 march cps survey is matched with 1969 UI claims
. * do this in statemp data set which has all states and years, before relabeling states with cps limited fips cod
> es
. 
. keep year xstatefip urated uratedus ruratedx urate urateus

. replace year = year + 1
(3,710 real changes made)

. sort year xstatefip

. tempfile tempUI

. save tempUI, replace
file tempUI.dta saved

. clear

. 
. restore

. drop urated uratedus ruratedx urate urateus

. sort year xstatefip

. merge year xstatefip using tempUI
(note: you are using old merge syntax; see [D] merge for new syntax)

. tab1 _merge 

-> tabulation of _merge  

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         52        1.38        1.38
          2 |         52        1.38        2.76
          3 |      3,660       97.24      100.00
------------+-----------------------------------
      Total |      3,764      100.00

. tab1 year if _merge < 3

-> tabulation of year if _merge < 3 

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1938 |         51       49.04       49.04
       1969 |          1        0.96       50.00
       2009 |          3        2.88       52.88
       2010 |         49       47.12      100.00
------------+-----------------------------------
      Total |        104      100.00

. drop _merge

. 
. sort year abbrev

. 
. preserve

. 
. ** Create first differences, leads and lags 
. 
. collapse (mean) gapus ur12 uratedus (sd) sdur12=ur12, by(year)

. summ

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         73        1974    21.21713       1938       2010
       gapus |         71   -.0005613     .027134  -.0663123   .0941144
        ur12 |         61    .0561448    .0144667   .0293333   .1009167
    uratedus |         70    2.55e-09    .0323313    -.08611   .1311143
      sdur12 |         61    3.15e-17    2.36e-17          0   8.41e-17

. drop sdur12

. sort year

. 
. gen c1gapus  = gapus[_n] - gapus[_n-1]
(4 missing values generated)

. *gen c1ur12 = ur12[_n] - ur12[_n-1]
. gen c1uratedus = uratedus[_n] - uratedus[_n-1]
(5 missing values generated)

. 
. gen l1gapus = gapus[_n-1]
(3 missing values generated)

. gen l1ur12 = ur12[_n-1]
(13 missing values generated)

. gen l1uratedus = uratedus[_n-1]
(4 missing values generated)

. 
. gen L1gapus = gapus[_n+1]
(3 missing values generated)

. gen L1ur12 = ur12[_n+1]
(13 missing values generated)

. gen L1uratedus = uratedus[_n+1]
(4 missing values generated)

. 
. sort year

. *list
. tempfile tempdev

. save tempdev, replace
file tempdev.dta saved

. clear

. 
. 
. restore

. 
. sort year

. merge year using tempdev
(note: you are using old merge syntax; see [D] merge for new syntax)
variable year does not uniquely identify observations in the master data

. tab1 _merge

-> tabulation of _merge  

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |      3,764      100.00      100.00
------------+-----------------------------------
      Total |      3,764      100.00

. drop _merge

. 
. sort abbrev year

. by abbrev: gen c1gap = gap[_n] - gap[_n-1]
(370 missing values generated)

. *by abbrev: gen c1ruc_rst = ruc_rst[_n] - ruc_rst[_n-1]
. by abbrev: gen c1urated = urated[_n] - urated[_n-1]
(330 missing values generated)

. 
. by abbrev: gen l1gap = gap[_n-1]
(370 missing values generated)

. by abbrev: gen l1ruc_rst = ruc_rst[_n-1]
(2,196 missing values generated)

. by abbrev: gen l1urated = urated[_n-1]
(291 missing values generated)

. 
. by abbrev: gen L1gap = gap[_n+1]
(367 missing values generated)

. by abbrev: gen L1ruc_rst = ruc_rst[_n+1]
(2,147 missing values generated)

. by abbrev: gen L1urated = urated[_n+1]
(242 missing values generated)

. 
. summ

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         lat |      3,528    39.39469    4.332804       30.3      46.97
         lon |      3,528    90.98816    15.13095       69.8        123
   xstatefip |      3,764    28.64532    15.88048          0         56
       dist1 |      3,528    876.4519    513.7288          0   2184.004
       dist4 |      3,528    1348.644    571.1334          0     2360.8
-------------+---------------------------------------------------------
       dist5 |      3,528    801.8498    422.2364          0   1809.896
       dist6 |      3,528    1674.285    740.4168          0   2769.255
       dist8 |      3,528    1021.322    481.0604          0   1885.345
       dist9 |      3,528    1057.801     764.484          0   2687.751
      dist10 |      3,528    943.6832     720.366          0   2571.503
-------------+---------------------------------------------------------
      dist11 |      3,528    895.4617     691.906          0   2494.503
      dist12 |      3,528    977.4713     536.869          0   2341.857
      dist13 |      3,528    846.5679    542.8661          0   2237.515
      dist16 |      3,528    1461.924    683.3946          0   2460.806
      dist17 |      3,528    745.3079    427.7586          0   1828.619
-------------+---------------------------------------------------------
      dist18 |      3,528    748.2479    485.5915          0   2004.814
      dist19 |      3,528    791.9457    383.5054          0   1595.174
      dist20 |      3,528    800.4283    390.7226          0   1545.461
      dist21 |      3,528     755.809    520.3149          0    2101.14
      dist22 |      3,528    949.3716    454.5134          0   2030.308
-------------+---------------------------------------------------------
      dist23 |      3,528    1228.832    774.3244          0   2820.251
      dist24 |      3,528     904.941    699.8945          0   2508.623
      dist25 |      3,528    1132.453    781.9427          0   2767.425
      dist26 |      3,528    811.4658    493.1132          0   2050.542
      dist27 |      3,528    871.8275    361.5697          0   1588.318
-------------+---------------------------------------------------------
      dist28 |      3,528    871.3257    463.3502          0   2012.586
      dist29 |      3,528    757.3299    407.4019          0   1728.335
      dist30 |      3,528    1366.233    595.0654          0   2242.142
      dist31 |      3,528    828.8153    386.0236          0   1449.033
      dist32 |      3,528    1590.796     728.483          0   2669.796
-------------+---------------------------------------------------------
      dist33 |      3,528    1128.033    772.1505          0   2736.628
      dist34 |      3,528    967.2147    731.5928          0   2589.832
      dist35 |      3,528    1095.479    490.2581          0   2014.626
      dist36 |      3,528    1034.101    739.5647          0   2618.587
      dist37 |      3,528    891.8226    644.4224          0   2460.941
-------------+---------------------------------------------------------
      dist38 |      3,528    1049.634    397.8178          0   1649.063
      dist39 |      3,528    782.0385    554.4921          0   2175.054
      dist40 |      3,528    877.3152    402.3635          0   1597.129
      dist41 |      3,528    1780.419    766.2417          0   2819.905
      dist42 |      3,528    903.8546    693.1514          0   2484.819
-------------+---------------------------------------------------------
      dist44 |      3,528    1107.298    779.1957          0   2751.835
      dist45 |      3,528    890.1186    596.1698          0   2390.132
      dist46 |      3,528     965.106    402.9258          0   1615.445
      dist47 |      3,528    767.9455    496.1929          0   2060.873
      dist48 |      3,528    1039.868    415.6267          0   1767.793
-------------+---------------------------------------------------------
      dist49 |      3,528    1268.358    608.0315          0   2248.356
      dist50 |      3,528    1113.832    745.1331          0   2674.348
      dist51 |      3,528    900.7542    680.0432          0   2502.289
      dist53 |      3,528    1815.924    754.7936          0   2820.251
      dist54 |      3,528     797.865    590.4586          0   2268.133
-------------+---------------------------------------------------------
      dist55 |      3,528    800.3707     407.844          0   1798.887
      dist56 |      3,528    1026.804    480.0067          0   1868.941
        year |      3,762    1974.144    21.04241       1938       2010
         inc |      2,040    18201.16    11206.95       2403      66119
       incus |      2,040     18787.7    10941.76       3836      40208
-------------+---------------------------------------------------------
        rinc |      2,040   -.0457383    .1517307  -.4677122   .5838141
      uratet |      3,570    .1149943     .047315   .0135061   .3952213
    uratetus |      3,570     .112969    .0227483   .0808968   .1525226
      rurate |      3,522     .000601     .049465  -.1639377   .4707959
     rurated |      3,522   -.0009607     .022693  -.1328874   .2424239
-------------+---------------------------------------------------------
    medval05 |      3,481    175502.5    86779.09      82700     477700
      abbrev |          0
       hpius |      1,666     85.6781    46.85268    22.5764   195.7144
      ee_rst |      3,443    1633.208    1987.151       32.3    15152.2
        ur12 |      2,989    .0561448      .01435   .0293333   .1009167
-------------+---------------------------------------------------------
        eeus |      3,479    81344.48    32817.19      30280     137858
       eetus |      3,479    81344.48    32746.41   32334.27   136773.8
     ruc_rst |      1,617    .0582509    .0195626     .02275   .1665833
     eet_rst |      3,479    1636.485    1977.443   36.67463    15057.1
         hpi |      1,666    83.96232    41.83461    17.9036   271.9248
-------------+---------------------------------------------------------
    c1ee_rst |      3,394     .024253    .0386514  -.1439446   .3962767
      c1eeus |      3,430    .0217041    .0301483  -.0419852   .1094774
       hpi05 |      3,479    152.5871    29.47607   118.7637   237.5531
          hp |      1,666    93708.68    63313.29   16734.77   546818.7
        hpus |      1,666    41034.75    22439.67   10812.76   93735.63
-------------+---------------------------------------------------------
         lhp |      1,666    11.26892     .586532   9.725244   13.21187
       lhpus |      1,666    10.47204    .5593164   9.288483   11.44823
      dlhpus |      1,617    .0530056    .0784484  -.2474909    .167347
        dlhp |      1,617    .0485264    .0708433  -.3563633   .2857075
 p10c1ee_rst |      3,430   -.0026194     .027481  -.0957447   .0438394
-------------+---------------------------------------------------------
 p90c1ee_rst |      3,430    .0521752    .0361758  -.0096703   .1998307
  p9010c1emp |      3,430    .0547946    .0291782   .0210598   .1897296
         gap |      3,443   -.0009445    .0349331  -.1532079   .2397948
       gapus |      3,479   -.0005613    .0269461  -.0663123   .0941144
        rgap |      3,443   -.0003789    .0239706  -.1424526   .1511222
-------------+---------------------------------------------------------
        rruc |      1,617    -.003345     .014784    -.04575   .0768333
        rlhp |      1,666    .7968856    .3419874  -.1223097   1.763638
       rdlhp |      1,617   -.0044792    .0580492  -.1781759   .2782669
         pce |      1,715    72.52429    22.36135      31.46     108.45
        pce1 |      1,666    71.46765    21.80929      31.46     107.97
-------------+---------------------------------------------------------
     rdlhpus |      1,617    .0172713    .0736648  -.2519267   .1332943
          ur |      1,617    .0582509    .0195626     .02275   .1665833
      p10gap |      3,619   -.0278736    .0273356  -.1205285   .0168136
       p10ur |      1,681    .0393312    .0086128   .0276667      .0695
   p10urated |      3,570   -.0178664    .0309166    -.12881   .0747824
-------------+---------------------------------------------------------
    p10urate |      3,570    .0690844       .0354   .0056314   .2510797
      p25gap |      3,619   -.0145157    .0263467  -.1030273   .0535361
       p25ur |      1,681    .0484904    .0108847   .0315833   .0803333
   p25urated |      3,570   -.0095064     .028464  -.1011308   .0805588
    p25urate |      3,570    .0855982    .0396019   .0081758   .2726566
-------------+---------------------------------------------------------
      p75gap |      3,619    .0113937    .0282237  -.0423817   .1429196
       p75ur |      1,681    .0671145    .0159457     .04425   .1106667
   p75urated |      3,570    .0111879    .0345345  -.0675555    .150157
    p75urate |      3,570    .1431561    .0597404    .020829   .4477757
      p90gap |      3,619    .0262185    .0294656  -.0169712   .1632139
-------------+---------------------------------------------------------
       p90ur |      1,681    .0756882    .0170389   .0514167   .1228333
   p90urated |      3,570    .0211357    .0380626  -.0536315   .1706473
    p90urate |      3,570    .1668886    .0643892   .0255922   .4533716
    p9010gap |      3,619    .0540921     .025764   .0180177   .1533077
    p7525gap |      3,619    .0259094    .0149727   .0084936   .0893835
-------------+---------------------------------------------------------
       sdgap |      3,619    .0217096    .0099992   .0067782   .0631928
     p9010ur |      1,681     .036357    .0104216     .02375   .0569167
     p7525ur |      1,681    .0186241    .0063938   .0104167      .0305
        sdur |      1,681    .0141506    .0044368   .0086605   .0236502
 p9010urated |      3,570    .0390021     .022449   .0102057   .1073365
-------------+---------------------------------------------------------
 p7525urated |      3,570    .0206943    .0131199   .0053706   .0695982
    sdurated |      3,570    .0183711    .0109705   .0049283   .0553466
  p9010urate |      3,570    .0978042    .0364989   .0199608   .2315579
  p7525urate |      3,570    .0575579    .0237939   .0126532   .1751191
     sdurate |      3,570    .0461505    .0169279   .0087901   .1027301
-------------+---------------------------------------------------------
      gappos |      3,672     23.1378    16.53676          0         49
        ngap |      3,672    47.79276        5.87          0         49
     gapposs |      3,619    .4841193    .3385999          0          1
     c1eepos |      3,672    37.17892    14.81523          0         49
       nc1ee |      3,672     47.1122    8.105941          0         49
-------------+---------------------------------------------------------
    c1eeposs |      3,568    .7884414    .2782845   .0612245          1
      rgapx2 |      3,479   -.0003803    .0049912  -.0148697   .0093639
       rgapx |      3,672   -.0003515        .007  -.0282374   .0322613
        gapx |      3,672   -.0008822    .0254844  -.0846998   .1226182
     ruratex |      3,672   -.0020183    .0117641  -.0540926    .097428
-------------+---------------------------------------------------------
       rrucx |      3,672   -.0015166    .0030159   -.018206   .0062761
       c1eex |      3,672    .0214915    .0287928  -.0429302   .1660637
       rlhpx |      3,672    .3672046    .4129948          0    1.18891
      rdlhpx |      3,672   -.0020405    .0241199  -.1036335   .1373355
       rincx |      3,672   -.0234295    .0403634  -.1500938   .1141917
-------------+---------------------------------------------------------
      rgapx3 |      3,443    6.82e-12    .0239506  -.1539243   .1509875
    urateus1 |      3,570     .112969    .0409248   .0177543   .2323321
   uratedus1 |      3,570    2.55e-09     .032104    -.08611   .1311143
     rurate1 |      3,522     .000601     .049465  -.1639377   .4707959
    rurate11 |      3,471     .000651    .0496742  -.1639377   .4707959
-------------+---------------------------------------------------------
    ruratex1 |      3,621   -.0020468    .0118442  -.0540926    .097428
    rurated1 |      3,522   -.0009607     .022693  -.1328874   .2424239
   rurated11 |      3,471   -.0009573    .0228298  -.1328874   .2424239
       rgap1 |      3,394   -.0004908    .0240404  -.1424526   .1511222
       rruc1 |      1,568   -.0032875    .0147816    -.04575   .0768333
-------------+---------------------------------------------------------
      lhpus1 |      1,617     10.4549    .5588609   9.288483   11.44823
       rlhp1 |      1,617    .7962536    .3407713  -.1223097   1.763638
      rlhpx1 |      3,621    .3611268    .4119438          0    1.18891
     dlhpus1 |      1,568    .0623961    .0586066  -.1367617    .167347
      rdlhp1 |      1,568   -.0081518    .0530541  -.1781759   .2086897
-------------+---------------------------------------------------------
     rdlhpx1 |      3,621   -.0036535    .0197957  -.1036335   .1028045
        inc1 |      2,040    18201.16    11206.95       2403      66119
       rinc1 |      2,040   -.0457383    .1517307  -.4677122   .5838141
      incus1 |      2,040     18787.7    10941.76       3836      40208
      rincx1 |      3,621   -.0237595    .0405502  -.1500938   .1141917
-------------+---------------------------------------------------------
      rinc11 |      1,989   -.0462317    .1515563  -.4677122   .5838141
      rlhp11 |      1,568    .7991147    .3375957  -.1223097   1.763638
     rppioil |      2,080     .627305    .2566148      .2871      1.454
   dlrppioil |      2,080    .0321592    .2006253  -.5587307    .471563
  dlrppioil1 |      2,080     .025118    .1972384  -.5587307    .471563
-------------+---------------------------------------------------------
 dlrppioil12 |      2,080    .0395152    .0669759   .0000121     .31218
   bartik15n |        714    .0154553    .0086842  -.0084983   .0332982
  bartik610n |        459    .0111039     .009055  -.0122312   .0326394
 oilshare15n |        728    .0024508    .0045921          0   .0270788
oilshare610n |        468    .0025459    .0047979          0   .0270788
-------------+---------------------------------------------------------
   bartik15s |      1,428    .0148255    .0154888  -.0475526   .0527953
  bartik610s |      1,173    .0127518    .0127742  -.0343186   .0526899
 oilshare15s |      1,456    .0061901    .0131834          0   .0863899
oilshare610s |      1,196    .0066019    .0139347          0   .0863899
    bartik15 |      1,785    .0144225    .0143671  -.0475526   .0527953
-------------+---------------------------------------------------------
   bartik610 |      1,530    .0124521    .0119251  -.0343186   .0526899
   bartik15a |      1,820    .0144225    .0138035  -.0248581   .0427427
  bartik610a |      1,560    .0124521    .0112449  -.0116896   .0395753
   bartik15r |      1,785    3.79e-11    .0039844  -.0282066   .0172427
  bartik610r |      1,530   -2.17e-11    .0039698   -.022898   .0168132
-------------+---------------------------------------------------------
  bartik15r1 |      1,734    3.58e-11    .0040034  -.0282066   .0172427
  bartik15r2 |      1,683    3.14e-11    .0040342  -.0282066   .0172427
 bartik610r1 |      1,479   -1.91e-11    .0039793   -.022898   .0168132
 bartik610r2 |      1,428    1.02e-11    .0040034   -.022898   .0168132
  oilshock15 |      1,820    .0000311    .0027661  -.0482687   .0183742
-------------+---------------------------------------------------------
 oilshock610 |      1,560   -1.81e-06     .002847  -.0366746   .0166535
 oilshock151 |      1,820    .0000197    .0026806  -.0452416   .0204637
oilshock6101 |      1,560   -.0000604    .0028731  -.0408451   .0169686
oilshock1512 |      1,820    .0002227    .0011412          0   .0252779
oilsho~61012 |      1,560    .0002567    .0011554          0   .0228214
-------------+---------------------------------------------------------
 oilshock15a |      1,820    .0000311     .001204  -.0049895   .0018441
 oilshock15r |      1,820    7.00e-12    .0024903  -.0432792   .0165301
oilshock610a |      1,560   -1.81e-06    .0012523  -.0036808    .001853
oilshock610r |      1,560    1.29e-12    .0025568  -.0329938   .0149271
oilshock151a |      1,820    .0000197    .0011965  -.0049673   .0021125
-------------+---------------------------------------------------------
oilshock151r |      1,820    1.90e-12    .0023988  -.0402744   .0183512
oilsho~6101a |      1,560   -.0000604     .001265  -.0042165    .001754
oilsho~6101r |      1,560    1.02e-11    .0025796  -.0366286   .0152145
oilsho~1512a |      1,820    .0002227    .0004736   2.75e-08   .0027754
oilsho~1512r |      1,820    1.77e-12    .0010383  -.0027754   .0225025
-------------+---------------------------------------------------------
oilsh~61012a |      1,560    .0002567    .0004539   3.16e-08   .0023559
oilsh~61012r |      1,560    5.29e-12    .0010626  -.0023559   .0204655
       urate |      3,522     .114802     .062682   .0007409   .6041837
      urated |      3,522    6.04e-10    .0357701  -.1861619   .3240443
     urateus |      3,570     .112969    .0409248   .0177543   .2323321
-------------+---------------------------------------------------------
    uratedus |      3,570    2.55e-09     .032104    -.08611   .1311143
    ruratedx |      3,672   -.0008983    .0077743  -.0471272   .0653785
     c1gapus |      3,611    .0004192    .0260235  -.0653257   .0665477
  c1uratedus |      3,560    .0012252    .0419091  -.0992522   .2028909
     l1gapus |      3,660   -.0005183    .0268649  -.0663123   .0941144
-------------+---------------------------------------------------------
      l1ur12 |      3,150    .0561824    .0143584   .0293333   .1009167
  l1uratedus |      3,609   -.0000172    .0319863    -.08611   .1311143
     L1gapus |      3,661   -.0005575    .0268749  -.0663123   .0941144
      L1ur12 |      3,151    .0562044    .0143507   .0293333   .1009167
  L1uratedus |      3,610    5.40e-06    .0319801    -.08611   .1311143
-------------+---------------------------------------------------------
       c1gap |      3,394    .0004235    .0321483  -.1772275   .2847034
    c1urated |      3,434   -.0013741    .0398347  -.3103697   .3066066
       l1gap |      3,394   -.0005593    .0349779  -.1532079   .2397948
   l1ruc_rst |      1,568    .0581656    .0196882     .02275   .1665833
    l1urated |      3,473   -.0001699    .0359769  -.1861619   .3240443
-------------+---------------------------------------------------------
       L1gap |      3,397   -.0001174    .0340698   -.146152   .2397948
   L1ruc_rst |      1,617    .0582509    .0195626     .02275   .1665833
    L1urated |      3,522    6.04e-10    .0357701  -.1861619   .3240443

. 
. *summ if c1ur12==.
. *summ if c1ur12~=.
. *summ if year >= 1963
. *summ if ruc_rst~=.
. 
. *save statecycle_ipums, replace
. 
. tempfile tempstateemp

. save tempstateemp, replace
file tempstateemp.dta saved

. clear

. 
. 
. ** Merge in cps fips codes by year of survey
. 
. use tempstateemp

. drop if year > 1967 | year < 1963
(3,509 observations deleted)

. summ year

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |        255        1965    1.416995       1963       1967

. sort abbrev year

. merge abbrev using ipumscps_statecodes.dta
(note: you are using old merge syntax; see [D] merge for new syntax)
variable abbrev does not uniquely identify observations in the master data

. tab1 _merge

-> tabulation of _merge  

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         10        3.89        3.89
          2 |          2        0.78        4.67
          3 |        245       95.33      100.00
------------+-----------------------------------
      Total |        257      100.00

. drop _merge

. drop code6872 code7375 code76 code77plus

. rename code6367 statefip

. *summ
. tempfile temp6367

. save temp6367, replace
file temp6367.dta saved

. clear

. 
. use tempstateemp

. drop if year > 1972 | year < 1968
(3,505 observations deleted)

. summ year

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |        259    1970.008    1.414192       1968       1972

. sort abbrev year

. merge abbrev using ipumscps_statecodes.dta
(note: you are using old merge syntax; see [D] merge for new syntax)
variable abbrev does not uniquely identify observations in the master data

. tab1 _merge

-> tabulation of _merge  

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         14        5.36        5.36
          2 |          2        0.77        6.13
          3 |        245       93.87      100.00
------------+-----------------------------------
      Total |        261      100.00

. drop _merge

. drop code6367 code7375 code76 code77plus

. rename code6872 statefip

. tempfile temp6872

. save temp6872, replace
file temp6872.dta saved

. clear

. 
. use tempstateemp

. drop if year > 1975 | year < 1973
(3,608 observations deleted)

. summ year

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |        156        1974    .8191262       1973       1975

. sort abbrev year

. merge abbrev using ipumscps_statecodes.dta
(note: you are using old merge syntax; see [D] merge for new syntax)
variable abbrev does not uniquely identify observations in the master data

. tab1 _merge

-> tabulation of _merge  

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          9        5.70        5.70
          2 |          2        1.27        6.96
          3 |        147       93.04      100.00
------------+-----------------------------------
      Total |        158      100.00

. drop _merge

. drop code6367 code6872 code76 code77plus

. rename code7375 statefip

. tempfile temp7375

. save temp7375, replace
file temp7375.dta saved

. clear

. 
. use tempstateemp

. drop if year ~= 1976
(3,712 observations deleted)

. summ year

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         52        1976           0       1976       1976

. sort abbrev year

. merge abbrev using ipumscps_statecodes.dta
(note: you are using old merge syntax; see [D] merge for new syntax)
variable abbrev does not uniquely identify observations in the master data

. tab1 _merge

-> tabulation of _merge  

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          3        5.56        5.56
          2 |          2        3.70        9.26
          3 |         49       90.74      100.00
------------+-----------------------------------
      Total |         54      100.00

. drop _merge

. drop code6367 code6872 code7375 code77plus

. rename code76 statefip

. tempfile temp76

. save temp76, replace
file temp76.dta saved

. clear

. 
. use tempstateemp

. drop if year < 1977
(1,997 observations deleted)

. summ year

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |      1,765    1993.472    9.798186       1977       2010

. sort abbrev year

. merge abbrev using ipumscps_statecodes.dta
(note: you are using old merge syntax; see [D] merge for new syntax)
variable abbrev does not uniquely identify observations in the master data

. tab1 _merge

-> tabulation of _merge  

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        150        8.48        8.48
          2 |          2        0.11        8.59
          3 |      1,617       91.41      100.00
------------+-----------------------------------
      Total |      1,769      100.00

. drop _merge

. drop code6367 code6872 code7375 code76

. rename code77plus statefip

. tempfile temp77plus

. save temp77plus, replace
file temp77plus.dta saved

. clear

. 
. use temp6367

. append using temp6872

. append using temp7375

. append using temp76

. append using temp77plus

. 
. *summ
. 
. sort year statefip

. summ year

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |      2,487    1986.522    13.81848       1963       2010

. 
. /*
> merge year using tempcycle
> tab1 _merge
> tab1 year if _merge < 3
> drop if _merge < 3
> drop _merge
> */
. 
. *summ
. 
. * save statecycle_ipums.dta, replace
. * clear
. 
. 
. * have to collapse to get correct means for years in which states not separately identified
. * this drops a bunch of things from bartik.dta not specified in list below
. 
. #delimit ;
delimiter now ;
. drop if statefip < 1 | statefip >= 99 ;
(186 observations deleted)

. drop if statefip==0 ;
(0 observations deleted)

. drop abbrev abbrevlc xstatefip fullname ;

. collapse ruc_rst ee_rst c1ee_rst p10c1ee_rst p90c1ee_rst p9010c1emp 
>    ur12 eeus eetus eet_rst 
>    gapus gap urated uratedus rgap rgapx gapx rrucx ruratedx
>    urate urateus 
>    bartik15r oilshock151r oilshock1512r, 
>    by(year statefip) ;

. *collapse ruc_rst ee_rst c1ee_rst p10c1ee_rst p90c1ee_rst p9010c1emp 
>    ur12 c1ur12 c1ruc_rst c1eeus eeus eetus eet_rst 
>    gapus gap c1gapus c1gap urated uratedus rgap rgapx gapx c1eex rrucx ruratedx
>    c1uratedus c1urated l1gapus l1ur12 l1uratedus L1gapus L1ur12 L1uratedus 
>    l1gap l1ruc_rst l1urated L1gap L1ruc_rst L1urated
>    urate urateus 
>    bartik15r oilshock151r oilshock1512r, 
>    by(year statefip) ;
. * Current preferred BC vars are gapus, rgap, ur12, rruc, urateus and rurate ;
. * Controls for state conditions relative to national ;
. * relative state unemployment and scaled unemployment ;
. gen rruc = ruc_rst - ur12 ;
(491 missing values generated)

. * relative deviation of state emp growth from HP trend - already in data ;
. *gen rgap = gap - gapus ;
. * relative state UI claims rate ;
. gen rurate = urate - urateus ;
(4 missing values generated)

. summ gapus rgap urateus rurate ur12 rruc ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       gapus |      2,104   -.0003652    .0194517  -.0464203   .0358762
        rgap |      2,104    .0002153    .0189179  -.1046872    .123191
     urateus |      2,104    .1030702    .0256035    .067097   .1887099
      rurate |      2,104   -.0007191    .0333471  -.1160798   .2082308
        ur12 |      2,104    .0588996     .014009     .03475   .1009167
-------------+---------------------------------------------------------
        rruc |      1,617    -.003345     .014784    -.04575   .0768333

. summ ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |      2,104    1987.291    13.47497       1963       2009
    statefip |      2,108    31.81594    18.19246          1         90
     ruc_rst |      1,617    .0582509    .0195626     .02275   .1665833
      ee_rst |      2,104    2122.116     2266.85       86.6    15152.2
    c1ee_rst |      2,104    .0206309    .0268889  -.1136479   .1561604
-------------+---------------------------------------------------------
 p10c1ee_rst |      2,104    .0001911    .0207687  -.0530619    .036117
 p90c1ee_rst |      2,104    .0424231    .0208888  -.0096703   .0946284
  p9010c1emp |      2,104     .042232     .013173   .0210598   .0786725
        ur12 |      2,104    .0588996     .014009     .03475   .1009167
        eeus |      2,104    101902.7    24854.76      56322     137858
-------------+---------------------------------------------------------
       eetus |      2,104    101896.4    24719.28   57839.04   136773.8
     eet_rst |      2,104    2121.753    2264.816   86.12218    15057.1
       gapus |      2,104   -.0003652    .0194517  -.0464203   .0358762
         gap |      2,104   -.0001498    .0262461  -.1037854   .1108117
      urated |      2,104   -.0009482    .0209915  -.0707031   .1543362
-------------+---------------------------------------------------------
    uratedus |      2,104   -.0009748    .0160638  -.0292472   .0636319
        rgap |      2,104    .0002153    .0189179  -.1046872    .123191
       rgapx |      2,104   -.0000272    .0071839  -.0282374   .0300961
        gapx |      2,104   -.0003924    .0194836  -.0520897   .0596072
       rrucx |      2,104   -.0026468    .0035895   -.018206   .0062761
-------------+---------------------------------------------------------
    ruratedx |      2,104   -.0000827    .0036202  -.0135247   .0194139
       urate |      2,104    .1023512    .0428673   .0244119   .3186108
     urateus |      2,104    .1030702    .0256035    .067097   .1887099
   bartik15r |      1,637   -.0000213     .003785  -.0282066   .0172427
oilshock151r |      1,637   -9.29e-07     .002417  -.0402744   .0183512
-------------+---------------------------------------------------------
oilsho~1512r |      1,637   -6.35e-06    .0010582  -.0027754   .0225025
        rruc |      1,617    -.003345     .014784    -.04575   .0768333
      rurate |      2,104   -.0007191    .0333471  -.1160798   .2082308

. tab1 year ;

-> tabulation of year  

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1963 |         49        2.33        2.33
       1964 |         49        2.33        4.66
       1965 |         49        2.33        6.99
       1966 |         49        2.33        9.32
       1967 |         49        2.33       11.64
       1968 |         30        1.43       13.07
       1969 |         30        1.43       14.50
       1970 |         30        1.43       15.92
       1971 |         30        1.43       17.35
       1972 |         30        1.43       18.77
       1973 |         23        1.09       19.87
       1974 |         23        1.09       20.96
       1975 |         23        1.09       22.05
       1976 |         23        1.09       23.15
       1977 |         49        2.33       25.48
       1978 |         49        2.33       27.80
       1979 |         49        2.33       30.13
       1980 |         49        2.33       32.46
       1981 |         49        2.33       34.79
       1982 |         49        2.33       37.12
       1983 |         49        2.33       39.45
       1984 |         49        2.33       41.78
       1985 |         49        2.33       44.11
       1986 |         49        2.33       46.44
       1987 |         49        2.33       48.76
       1988 |         49        2.33       51.09
       1989 |         49        2.33       53.42
       1990 |         49        2.33       55.75
       1991 |         49        2.33       58.08
       1992 |         49        2.33       60.41
       1993 |         49        2.33       62.74
       1994 |         49        2.33       65.07
       1995 |         49        2.33       67.40
       1996 |         49        2.33       69.72
       1997 |         49        2.33       72.05
       1998 |         49        2.33       74.38
       1999 |         49        2.33       76.71
       2000 |         49        2.33       79.04
       2001 |         49        2.33       81.37
       2002 |         49        2.33       83.70
       2003 |         49        2.33       86.03
       2004 |         49        2.33       88.36
       2005 |         49        2.33       90.68
       2006 |         49        2.33       93.01
       2007 |         49        2.33       95.34
       2008 |         49        2.33       97.67
       2009 |         49        2.33      100.00
------------+-----------------------------------
      Total |      2,104      100.00

. sort year statefip ;

. sort year ;

. by year: summ ;

------------------------------------------------------------------------------------------------------------------
-> year = 1963

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1963           0       1963       1963
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |          0
      ee_rst |         49    1121.255    1298.412       86.6     6161.9
    c1ee_rst |         49     .024359    .0260778  -.0147896   .1532534
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0070941           0  -.0070941  -.0070941
 p90c1ee_rst |         49    .0436615           0   .0436615   .0436615
  p9010c1emp |         49    .0507557           0   .0507557   .0507557
        ur12 |         49        .056           0       .056       .056
        eeus |         49       56322           0      56322      56322
-------------+---------------------------------------------------------
       eetus |         49    57839.04           0   57839.04   57839.04
     eet_rst |         49    1151.841    1334.416   86.12218   6316.438
       gapus |         49   -.0265787           0  -.0265787  -.0265787
         gap |         49   -.0186955    .0230645     -.0541   .0710572
      urated |         49    .0052441    .0137994  -.0375688   .0527575
-------------+---------------------------------------------------------
    uratedus |         49    .0078611           0   .0078611   .0078611
        rgap |         49    .0078832    .0230645  -.0275213   .0976359
       rgapx |         49      .00623    .0069762  -.0016054   .0300961
        gapx |         49   -.0203487    .0069762   -.028184   .0035175
       rrucx |         49           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         49    -.001991    .0024237  -.0117509   .0036918
       urate |         49    .1415603     .033551    .065567   .2183273
     urateus |         49    .1471065           0   .1471065   .1471065
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         49   -.0055462     .033551  -.0815395   .0712209

------------------------------------------------------------------------------------------------------------------
-> year = 1964

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1964           0       1964       1964
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |          0
      ee_rst |         49    1151.771    1330.272       87.9     6247.7
    c1ee_rst |         49    .0259173    .0142835  -.0067935   .0550591
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0050794           0   .0050794   .0050794
 p90c1ee_rst |         49    .0456953           0   .0456953   .0456953
  p9010c1emp |         49    .0406159           0   .0406159   .0406159
        ur12 |         49    .0556667           0   .0556667   .0556667
        eeus |         49       57898           0      57898      57898
-------------+---------------------------------------------------------
       eetus |         49    59341.06           0   59341.06   59341.06
     eet_rst |         49     1182.53    1363.301   87.25639   6401.543
       gapus |         49   -.0246186           0  -.0246186  -.0246186
         gap |         49   -.0219414     .018792  -.0593617   .0551609
      urated |         49     .008715    .0126326  -.0168796   .0408437
-------------+---------------------------------------------------------
    uratedus |         49    .0107474           0   .0107474   .0107474
        rgap |         49    .0026772     .018792  -.0347431   .0797795
       rgapx |         49    .0018799    .0047116  -.0050139    .019054
        gapx |         49   -.0227387    .0047116  -.0296325  -.0055646
       rrucx |         49           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         49   -.0019091    .0029203  -.0076907   .0053483
       urate |         49    .1385407    .0353939   .0705027   .2113263
     urateus |         49     .143777           0    .143777    .143777
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         49   -.0052363    .0353939  -.0732743   .0675493

------------------------------------------------------------------------------------------------------------------
-> year = 1965

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1965           0       1965       1965
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |          0
      ee_rst |         49    1196.063    1371.842       88.9     6373.1
    c1ee_rst |         49    .0390243    .0154645   .0113766   .0757946
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0186786           0   .0186786   .0186786
 p90c1ee_rst |         49    .0587803           0   .0587803   .0587803
  p9010c1emp |         49    .0401016           0   .0401016   .0401016
        ur12 |         49    .0501667           0   .0501667   .0501667
        eeus |         49       60003           0      60003      60003
-------------+---------------------------------------------------------
       eetus |         49     60978.7           0    60978.7    60978.7
     eet_rst |         49    1216.083    1394.521   88.72442   6491.612
       gapus |         49   -.0161301           0  -.0161301  -.0161301
         gap |         49   -.0142512    .0160994  -.0514587   .0552117
      urated |         49    .0015479    .0115381  -.0228628   .0264072
-------------+---------------------------------------------------------
    uratedus |         49     .000782           0    .000782    .000782
        rgap |         49    .0018789    .0160994  -.0353286   .0713418
       rgapx |         49    .0017085    .0030445  -.0031851   .0150387
        gapx |         49   -.0144216    .0030445  -.0193152  -.0010914
       rrucx |         49           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         49    .0002006    .0022651  -.0034593    .006959
       urate |         49     .124622    .0355957   .0623293   .2102118
     urateus |         49    .1272655           0   .1272655   .1272655
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         49   -.0026435    .0355957  -.0649362   .0829463

------------------------------------------------------------------------------------------------------------------
-> year = 1966

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1966           0       1966       1966
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |          0
      ee_rst |         49    1263.441    1436.965       89.1     6596.5
    c1ee_rst |         49    .0576505    .0184189   .0022497   .0982456
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0322388           0   .0322388   .0322388
 p90c1ee_rst |         49    .0787166           0   .0787166   .0787166
  p9010c1emp |         49    .0464778           0   .0464778   .0464778
        ur12 |         49       .0425           0      .0425      .0425
        eeus |         49       63191           0      63191      63191
-------------+---------------------------------------------------------
       eetus |         49    62720.29           0   62720.29   62720.29
     eet_rst |         49    1251.821    1427.244   90.64753   6582.777
       gapus |         49    .0074768           0   .0074768   .0074768
         gap |         49    .0099532    .0126569  -.0172194   .0393632
      urated |         49   -.0148624    .0139776  -.0518204   .0158201
-------------+---------------------------------------------------------
    uratedus |         49   -.0135142           0  -.0135142  -.0135142
        rgap |         49    .0024764    .0126569  -.0246962   .0318864
       rgapx |         49    .0029473     .002273  -.0024288   .0102686
        gapx |         49    .0104242     .002273    .005048   .0177455
       rrucx |         49           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         49   -.0019238    .0031825  -.0079389   .0054015
       urate |         49    .1018306     .031876   .0442953    .184075
     urateus |         49    .1067275           0   .1067275   .1067275
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         49   -.0048969     .031876  -.0624322   .0773475

------------------------------------------------------------------------------------------------------------------
-> year = 1967

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1967           0       1967       1967
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |          0
      ee_rst |         49    1312.167    1484.799       91.6     6743.1
    c1ee_rst |         49    .0382205    .0132643   .0136259   .0718014
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0222239           0   .0222239   .0222239
 p90c1ee_rst |         49     .057508           0    .057508    .057508
  p9010c1emp |         49     .035284           0    .035284    .035284
        ur12 |         49    .0378333           0   .0378333   .0378333
        eeus |         49       65530           0      65530      65530
-------------+---------------------------------------------------------
       eetus |         49    64524.41           0   64524.41   64524.41
     eet_rst |         49    1288.865    1460.429   93.14874   6669.986
       gapus |         49    .0154645           0   .0154645   .0154645
         gap |         49    .0150944    .0178409  -.0298922   .0519274
      urated |         49   -.0278719    .0152523  -.0689928   .0108296
-------------+---------------------------------------------------------
    uratedus |         49   -.0281452           0  -.0281452  -.0281452
        rgap |         49   -.0003701    .0178409  -.0453567   .0364629
       rgapx |         49    .0007861    .0043212  -.0104085   .0084473
        gapx |         49    .0162506    .0043212    .005056   .0239118
       rrucx |         49           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         49   -.0003023    .0041188  -.0114625   .0094191
       urate |         49     .083458     .031485   .0345051   .1759606
     urateus |         49    .0868011           0   .0868011   .0868011
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         49   -.0033431     .031485   -.052296   .0891595

------------------------------------------------------------------------------------------------------------------
-> year = 1968

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         30        1968           0       1968       1968
    statefip |         30    44.93333    26.10844          6         80
     ruc_rst |          0
      ee_rst |         30    1809.194    1723.305     190.68     6900.6
    c1ee_rst |         30    .0272183    .0140437  -.0164323   .0635126
-------------+---------------------------------------------------------
 p10c1ee_rst |         30    .0097383           0   .0097383   .0097383
 p90c1ee_rst |         30    .0414867           0   .0414867   .0414867
  p9010c1emp |         30    .0317484           0   .0317484   .0317484
        ur12 |         30    .0381667           0   .0381667   .0381667
        eeus |         30       67296           0      67296      67296
-------------+---------------------------------------------------------
       eetus |         30    66354.31           0   66354.31   66354.31
     eet_rst |         30    1776.912    1685.067    193.969   6748.323
       gapus |         30     .014092           0    .014092    .014092
         gap |         30    .0141452     .018977  -.0345318   .0727654
      urated |         30   -.0157034    .0103248  -.0529743   .0006365
-------------+---------------------------------------------------------
    uratedus |         30    -.016433           0   -.016433   -.016433
        rgap |         30    .0000532     .018977  -.0486238   .0586733
       rgapx |         30   -.0025136    .0045879  -.0139142   .0061688
        gapx |         30    .0115784    .0045879   .0001778   .0202609
       rrucx |         30           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         30    .0005234    .0028844  -.0056201   .0045407
       urate |         30    .0909853    .0279805   .0360103   .1419806
     urateus |         30     .094671           0    .094671    .094671
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         30   -.0036857    .0279805  -.0586607   .0473096

------------------------------------------------------------------------------------------------------------------
-> year = 1969

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         30        1969           0       1969       1969
    statefip |         30    44.93333    26.10844          6         80
     ruc_rst |          0
      ee_rst |         30    1876.917    1782.462     199.38     7074.2
    c1ee_rst |         30    .0366268    .0186397  -.0172236   .0796631
-------------+---------------------------------------------------------
 p10c1ee_rst |         30    .0087965           0   .0087965   .0087965
 p90c1ee_rst |         30    .0573707           0   .0573707   .0573707
  p9010c1emp |         30    .0485743           0   .0485743   .0485743
        ur12 |         30      .03475    7.06e-18     .03475     .03475
        eeus |         30       69906           0      69906      69906
-------------+---------------------------------------------------------
       eetus |         30    68183.36           0   68183.36   68183.36
     eet_rst |         30    1825.824    1718.799   202.4183   6813.604
       gapus |         30    .0249509           0   .0249509   .0249509
         gap |         30    .0193035     .019569  -.0232033   .0736758
      urated |         30   -.0237026    .0113105  -.0707031   -.010057
-------------+---------------------------------------------------------
    uratedus |         30   -.0255998           0  -.0255998  -.0255998
        rgap |         30   -.0056474     .019569  -.0481543   .0487248
       rgapx |         30   -.0099997    .0046678  -.0206112  -.0011386
        gapx |         30    .0149512    .0046678   .0043398   .0238123
       rrucx |         30           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         30     .002079    .0026449  -.0059774   .0044354
       urate |         30    .0811141    .0265252   .0295788   .1329526
     urateus |         30    .0833409           0   .0833409   .0833409
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         30   -.0022268    .0265252  -.0537622   .0496117

------------------------------------------------------------------------------------------------------------------
-> year = 1970

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         30        1970           0       1970       1970
    statefip |         30    44.93333    26.10844          6         80
     ruc_rst |          0
      ee_rst |         30    1912.896    1810.099     207.36     7156.4
    c1ee_rst |         30    .0219441    .0182051  -.0182922   .0689545
-------------+---------------------------------------------------------
 p10c1ee_rst |         30    .0042027           0   .0042027   .0042027
 p90c1ee_rst |         30    .0537976           0   .0537976   .0537976
  p9010c1emp |         30    .0495949           0   .0495949   .0495949
        ur12 |         30    .0368333           0   .0368333   .0368333
        eeus |         30       71453           0      71453      71453
-------------+---------------------------------------------------------
       eetus |         30    69994.28           0   69994.28   69994.28
     eet_rst |         30    1874.011    1750.987   211.6908   6863.167
       gapus |         30    .0206263           0   .0206263   .0206263
         gap |         30    .0109941     .018887  -.0224295    .041838
      urated |         30   -.0253804    .0081141  -.0386453  -.0030631
-------------+---------------------------------------------------------
    uratedus |         30   -.0280777           0  -.0280777  -.0280777
        rgap |         30   -.0096323     .018887  -.0430559   .0212117
       rgapx |         30   -.0118314    .0067872  -.0228563   .0010408
        gapx |         30     .008795    .0067872  -.0022299   .0216672
       rrucx |         30           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         30    .0021514    .0016966  -.0018494   .0042565
       urate |         30    .0793558    .0310169   .0286027   .1551986
     urateus |         30    .0804397           0   .0804397   .0804397
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         30   -.0010839    .0310169   -.051837   .0747588

------------------------------------------------------------------------------------------------------------------
-> year = 1971

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         30        1971           0       1971       1971
    statefip |         30    44.93333    26.10844          6         80
     ruc_rst |          0
      ee_rst |         30     1891.03    1767.372     213.18     6985.8
    c1ee_rst |         30   -.0032018    .0199304  -.0367124    .033847
-------------+---------------------------------------------------------
 p10c1ee_rst |         30   -.0244354           0  -.0244354  -.0244354
 p90c1ee_rst |         30    .0286563           0   .0286563   .0286563
  p9010c1emp |         30    .0530917           0   .0530917   .0530917
        ur12 |         30      .05425           0     .05425     .05425
        eeus |         30       70859           0      70859      70859
-------------+---------------------------------------------------------
       eetus |         30    71787.06           0   71787.06   71787.06
     eet_rst |         30    1921.543    1782.028   221.8031   7010.594
       gapus |         30   -.0130123           0  -.0130123  -.0130123
         gap |         30   -.0214732    .0164577  -.0508713   .0140228
      urated |         30    .0140465    .0253532  -.0260708   .1267759
-------------+---------------------------------------------------------
    uratedus |         30    .0129858           0   .0129858   .0129858
        rgap |         30   -.0084609    .0164577   -.037859   .0270351
       rgapx |         30   -.0091348    .0069395  -.0189813   .0064055
        gapx |         30   -.0221471    .0069395  -.0319936  -.0066068
       rrucx |         30           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         30    -.002593    .0038877  -.0094755   .0143796
       urate |         30     .120285    .0504795   .0525198   .3143662
     urateus |         30    .1226253           0   .1226253   .1226253
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         30   -.0023403    .0504795  -.0701055   .1917409

------------------------------------------------------------------------------------------------------------------
-> year = 1972

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         30        1972           0       1972       1972
    statefip |         30    44.93333    26.10844          6         80
     ruc_rst |          0
      ee_rst |         30    1950.291    1795.564     227.34     7105.9
    c1ee_rst |         30    .0411334    .0255121  -.0037218   .1013907
-------------+---------------------------------------------------------
 p10c1ee_rst |         30    .0106618           0   .0106618   .0106618
 p90c1ee_rst |         30    .0754653           0   .0754653   .0754653
  p9010c1emp |         30    .0648034           0   .0648034   .0648034
        ur12 |         30    .0590833    1.29e-18   .0590833   .0590833
        eeus |         30       72945           0      72945      72945
-------------+---------------------------------------------------------
       eetus |         30    73576.27           0   73576.27   73576.27
     eet_rst |         30    1968.881    1812.934   232.7286   7239.334
       gapus |         30   -.0086169           0  -.0086169  -.0086169
         gap |         30   -.0098856    .0164095   -.047594    .028126
      urated |         30    .0142105    .0147298    -.00898   .0594102
-------------+---------------------------------------------------------
    uratedus |         30    .0154172           0   .0154172   .0154172
        rgap |         30   -.0012687    .0164095  -.0389771   .0367428
       rgapx |         30    -.000776    .0058949  -.0120996   .0116669
        gapx |         30   -.0093928    .0058949  -.0207164     .00305
       rrucx |         30           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         30   -.0026622    .0029007  -.0065227   .0050802
       urate |         30    .1230716     .044756   .0554224   .2491731
     urateus |         30    .1272486           0   .1272486   .1272486
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         30    -.004177     .044756  -.0718262   .1219245

------------------------------------------------------------------------------------------------------------------
-> year = 1973

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         23        1973           0       1973       1973
    statefip |         23    50.65217    31.17197          6         90
     ruc_rst |          0
      ee_rst |         23    2398.095    2002.957    285.175       7458
    c1ee_rst |         23    .0516474    .0227447  -.0029762   .1142846
-------------+---------------------------------------------------------
 p10c1ee_rst |         23     .036117           0    .036117    .036117
 p90c1ee_rst |         23    .0798025           0   .0798025   .0798025
  p9010c1emp |         23    .0436856           0   .0436856   .0436856
        ur12 |         23    .0539167           0   .0539167   .0539167
        eeus |         23       76286           0      76286      76286
-------------+---------------------------------------------------------
       eetus |         23    75367.19           0   75367.19   75367.19
     eet_rst |         23    2363.976    1991.689   280.4779   7478.958
       gapus |         23    .0121174           0   .0121174   .0121174
         gap |         23    .0151175    .0199816  -.0131376   .0747797
      urated |         23   -.0150624     .013521  -.0490913   .0035078
-------------+---------------------------------------------------------
    uratedus |         23   -.0138397           0  -.0138397  -.0138397
        rgap |         23    .0030001    .0199816  -.0252551   .0626622
       rgapx |         23     .003383    .0051955  -.0075905   .0135261
        gapx |         23    .0155004    .0051955    .004527   .0256436
       rrucx |         23           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         23   -.0007546    .0028018  -.0056559   .0050921
       urate |         23    .0987996    .0398919   .0370056    .169378
     urateus |         23    .1009076           0   .1009076   .1009076
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |         23    -.002108    .0398919  -.0639019   .0684704

------------------------------------------------------------------------------------------------------------------
-> year = 1974

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         23        1974           0       1974       1974
    statefip |         23    50.65217    31.17197          6         90
     ruc_rst |          0
      ee_rst |         23    2453.311    2038.982    289.425     7707.5
    c1ee_rst |         23    .0257038    .0172558  -.0049866   .0588962
-------------+---------------------------------------------------------
 p10c1ee_rst |         23    .0025555           0   .0025555   .0025555
 p90c1ee_rst |         23    .0557405           0   .0557405   .0557405
  p9010c1emp |         23     .053185           0    .053185    .053185
        ur12 |         23    .0490833    6.78e-18   .0490833   .0490833
        eeus |         23       78295           0      78295      78295
-------------+---------------------------------------------------------
       eetus |         23    77158.79           0   77158.79   77158.79
     eet_rst |         23    2416.405    2027.619   287.3191   7730.364
       gapus |         23    .0146182           0   .0146182   .0146182
         gap |         23     .015404    .0183676  -.0192182   .0723615
      urated |         23   -.0294525    .0152134  -.0612702  -.0082032
-------------+---------------------------------------------------------
    uratedus |         23   -.0292472           0  -.0292472  -.0292472
        rgap |         23    .0007857    .0183676  -.0338365   .0577432
       rgapx |         23   -.0005615    .0039259   -.010644   .0047118
        gapx |         23    .0140567    .0039259   .0039743   .0193301
       rrucx |         23           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         23    .0003884     .003047  -.0037989   .0068965
       urate |         23    .0886024    .0388291   .0316375   .1591097
     urateus |         23    .0889485           0   .0889485   .0889485
   bartik15r |         23   -.0000807    .0052713  -.0130975   .0066199
oilshock151r |         23    .0000246    .0001509  -.0004506   .0001003
-------------+---------------------------------------------------------
oilsho~1512r |         23   -4.66e-07    2.86e-06  -1.90e-06   8.53e-06
        rruc |          0
      rurate |         23   -.0003461    .0388291   -.057311   .0701612

------------------------------------------------------------------------------------------------------------------
-> year = 1975

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         23        1975           0       1975       1975
    statefip |         23    50.65217    31.17197          6         90
     ruc_rst |          0
      ee_rst |         23    2394.212    2006.089    278.025     7681.7
    c1ee_rst |         23   -.0226402    .0226386  -.0586474   .0186724
-------------+---------------------------------------------------------
 p10c1ee_rst |         23   -.0530619           0  -.0530619  -.0530619
 p90c1ee_rst |         23    .0256107           0   .0256107   .0256107
  p9010c1emp |         23    .0786725           0   .0786725   .0786725
        ur12 |         23      .06425    4.18e-18     .06425     .06425
        eeus |         23       76649           0      76649      76649
-------------+---------------------------------------------------------
       eetus |         23    78959.23           0   78959.23   78959.23
     eet_rst |         23    2469.197     2066.09   294.5688   7994.245
       gapus |         23    -.029695           0   -.029695   -.029695
         gap |         23   -.0320865    .0134998  -.0567023  -.0061253
      urated |         23    .0043843    .0128418  -.0159228   .0330669
-------------+---------------------------------------------------------
    uratedus |         23    .0043422           0   .0043422   .0043422
        rgap |         23   -.0023915    .0134998  -.0270072   .0235698
       rgapx |         23   -.0024436    .0037633  -.0130261   .0039491
        gapx |         23   -.0321387    .0037633  -.0427212  -.0257459
       rrucx |         23           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         23   -.0008481    .0032436  -.0048081   .0059118
       urate |         23    .1268268    .0428207   .0407901   .2042418
     urateus |         23     .126189           0    .126189    .126189
   bartik15r |         23   -.0029184    .0087455  -.0226945   .0089064
oilshock151r |         23    -.000434    .0027258  -.0018004   .0081026
-------------+---------------------------------------------------------
oilsho~1512r |         23   -.0001504    .0009444  -.0006238   .0028074
        rruc |          0
      rurate |         23    .0006378    .0428207  -.0853988   .0780528

------------------------------------------------------------------------------------------------------------------
-> year = 1976

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         23        1976           0       1976       1976
    statefip |         23    50.78261    31.33246          6         90
     ruc_rst |          0
      ee_rst |         23    2460.456     2044.36    293.425     7992.2
    c1ee_rst |         23    .0344381    .0224023  -.0098207   .0684531
-------------+---------------------------------------------------------
 p10c1ee_rst |         23    .0109822           0   .0109822   .0109822
 p90c1ee_rst |         23    .0684531           0   .0684531   .0684531
  p9010c1emp |         23    .0574709           0   .0574709   .0574709
        ur12 |         23    .0834167    5.12e-18   .0834167   .0834167
        eeus |         23       79049           0      79049      79049
-------------+---------------------------------------------------------
       eetus |         23    80788.02           0   80788.02   80788.02
     eet_rst |         23    2523.135    2107.935   302.3505   8271.063
       gapus |         23   -.0217608           0  -.0217608  -.0217608
         gap |         23   -.0222884    .0132915  -.0475464  -.0031447
      urated |         23    .0688896    .0320361   .0273861   .1543362
-------------+---------------------------------------------------------
    uratedus |         23    .0636319           0   .0636319   .0636319
        rgap |         23   -.0005276    .0132915  -.0257856   .0186161
       rgapx |         23    .0025274    .0042081  -.0056099   .0071446
        gapx |         23   -.0192334    .0042081  -.0273707  -.0146162
       rrucx |         23           0           0          0          0
-------------+---------------------------------------------------------
    ruratedx |         23    .0027907    .0069499  -.0095195   .0194139
       urate |         23    .1952506    .0526609   .0726301   .2831275
     urateus |         23    .1887099           0   .1887099   .1887099
   bartik15r |         23    .0012395    .0037315  -.0118008   .0063152
oilshock151r |         23    -.000075    .0004749  -.0003131   .0013977
-------------+---------------------------------------------------------
oilsho~1512r |         23   -4.53e-06    .0000287  -.0000189   .0000844
        rruc |          0
      rurate |         23    .0065407    .0526609  -.1160798   .0944176

------------------------------------------------------------------------------------------------------------------
-> year = 1977

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1977           0       1977       1977
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0695663    .0182888   .0313333   .1051667
      ee_rst |         49    1639.145    1731.412      156.2     8369.2
    c1ee_rst |         49     .038414    .0200053  -.0123299   .1035514
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0161699           0   .0161699   .0161699
 p90c1ee_rst |         49    .0614224           0   .0614224   .0614224
  p9010c1emp |         49    .0452525           0   .0452525   .0452525
        ur12 |         49    .0764167           0   .0764167   .0764167
        eeus |         49       81391           0      81391      81391
-------------+---------------------------------------------------------
       eetus |         49     82641.6           0    82641.6    82641.6
     eet_rst |         49    1663.798    1773.106   161.2085   8558.157
       gapus |         49   -.0152485           0  -.0152485  -.0152485
         gap |         49    -.009317    .0203202  -.0567998    .033964
      urated |         49    .0105032    .0140364  -.0302787    .045947
-------------+---------------------------------------------------------
    uratedus |         49    .0125405           0   .0125405   .0125405
        rgap |         49    .0059315    .0203202  -.0415513   .0492125
       rgapx |         49    .0057591    .0044764  -.0062656   .0116522
        gapx |         49   -.0094894    .0044764  -.0215141  -.0035963
       rrucx |         49   -.0068767    .0053266  -.0149072   .0045717
-------------+---------------------------------------------------------
    ruratedx |         49   -.0023048    .0022145  -.0066413   .0034349
       urate |         49    .1378163    .0411156   .0514029   .2546504
     urateus |         49     .139851           0    .139851    .139851
   bartik15r |         49    .0003834    .0038117  -.0126983   .0094646
oilshock151r |         49   -3.14e-06     .000156  -.0006478   .0000707
-------------+---------------------------------------------------------
oilsho~1512r |         49    4.24e-08    2.11e-06  -9.56e-07   8.76e-06
        rruc |         49   -.0068503    .0182888  -.0450833     .02875
      rurate |         49   -.0020347    .0411156  -.0884481   .1147994

------------------------------------------------------------------------------------------------------------------
-> year = 1978

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1978           0       1978       1978
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0617296    .0139156      .0315   .0871667
      ee_rst |         49    1724.231    1822.536      177.5     9022.5
    c1ee_rst |         49    .0555485    .0300448    -.06293   .1363637
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0265721           0   .0265721   .0265721
 p90c1ee_rst |         49    .0946284           0   .0946284   .0946284
  p9010c1emp |         49    .0680563           0   .0680563   .0680563
        ur12 |         49    .0675833           0   .0675833   .0675833
        eeus |         49       85461           0      85461      85461
-------------+---------------------------------------------------------
       eetus |         49    84498.98           0   84498.98   84498.98
     eet_rst |         49    1702.107    1810.911   170.0195   8850.075
       gapus |         49    .0113206           0   .0113206   .0113206
         gap |         49    .0182335    .0241881  -.0547216   .0729378
      urated |         49   -.0051599    .0143818   -.036755   .0297416
-------------+---------------------------------------------------------
    uratedus |         49   -.0030551           0  -.0030551  -.0030551
        rgap |         49    .0069129    .0241881  -.0660423   .0616172
       rgapx |         49    .0053076    .0072093  -.0081855   .0191664
        gapx |         49    .0166282    .0072093   .0031352   .0304871
       rrucx |         49   -.0057752     .003789  -.0131866   .0027617
-------------+---------------------------------------------------------
    ruratedx |         49    -.001866     .002601  -.0053034   .0074506
       urate |         49    .1243301     .039372   .0461992   .2433944
     urateus |         49    .1255466           0   .1255466   .1255466
   bartik15r |         49    .0001159    .0035012   -.008693   .0059082
oilshock151r |         49    4.49e-06    .0002251  -.0001016   .0009484
-------------+---------------------------------------------------------
oilsho~1512r |         49    8.41e-08    4.22e-06  -1.90e-06   .0000178
        rruc |         49   -.0058537    .0139156  -.0360833   .0195833
      rurate |         49   -.0012165     .039372  -.0793475   .1178478

------------------------------------------------------------------------------------------------------------------
-> year = 1979

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1979           0       1979       1979
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0542789    .0126635     .02625   .0751667
      ee_rst |         49    1805.651    1901.683      190.6       9522
    c1ee_rst |         49     .051938     .025798   .0222386   .1561604
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0273555           0   .0273555   .0273555
 p90c1ee_rst |         49    .0699454           0   .0699454   .0699454
  p9010c1emp |         49    .0425899           0   .0425899   .0425899
        ur12 |         49       .0595           0      .0595      .0595
        eeus |         49       89480           0      89480      89480
-------------+---------------------------------------------------------
       eetus |         49     86326.7           0    86326.7    86326.7
     eet_rst |         49    1739.617    1849.734   177.9145   9139.476
       gapus |         49    .0358762           0   .0358762   .0358762
         gap |         49    .0442761    .0232768   -.001995   .0952919
      urated |         49   -.0211891     .023322  -.0547609   .1018255
-------------+---------------------------------------------------------
    uratedus |         49   -.0187542           0  -.0187542  -.0187542
        rgap |         49       .0084    .0232768  -.0378712   .0594158
       rgapx |         49    .0069693     .007887  -.0079262   .0237311
        gapx |         49    .0428455     .007887   .0279499   .0596072
       rrucx |         49   -.0050321    .0031931  -.0115587   .0030314
-------------+---------------------------------------------------------
    ruratedx |         49   -.0015026    .0055151  -.0099371   .0182713
       urate |         49    .1097738    .0477931   .0402387   .3186108
     urateus |         49    .1103801           0   .1103801   .1103801
   bartik15r |         49    .0000424    .0040699  -.0119884   .0064952
oilshock151r |         49    3.71e-06    .0001873  -.0000845   .0007955
-------------+---------------------------------------------------------
oilsho~1512r |         49    5.50e-08    2.77e-06  -1.25e-06   .0000118
        rruc |         49   -.0052211    .0126635    -.03325   .0156667
      rurate |         49   -.0006062    .0477931  -.0701413   .2082308

------------------------------------------------------------------------------------------------------------------
-> year = 1980

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1980           0       1980       1980
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0552687    .0129501   .0276667     .08675
      ee_rst |         49    1836.751    1944.488      198.5     9847.3
    c1ee_rst |         49    .0180598    .0210384  -.0368838   .0634202
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0052664           0  -.0052664  -.0052664
 p90c1ee_rst |         49    .0472589           0   .0472589   .0472589
  p9010c1emp |         49    .0525253           0   .0525253   .0525253
        ur12 |         49    .0595833           0   .0595833   .0595833
        eeus |         49       90991           0      90991      90991
-------------+---------------------------------------------------------
       eetus |         49    88100.89           0   88100.89   88100.89
     eet_rst |         49    1775.818    1888.767   184.5056   9420.742
       gapus |         49     .032278           0    .032278    .032278
         gap |         49    .0396542     .020358   .0016247   .0963297
      urated |         49    -.019211    .0143997  -.0520877   .0177414
-------------+---------------------------------------------------------
    uratedus |         49   -.0163309           0  -.0163309  -.0163309
        rgap |         49    .0073763     .020358  -.0306533   .0640518
       rgapx |         49    .0055927    .0078803  -.0076105    .024094
        gapx |         49    .0378707    .0078803   .0246674    .056372
       rrucx |         49   -.0040613    .0027571  -.0103838   .0018247
-------------+---------------------------------------------------------
    ruratedx |         49   -.0019633    .0032596  -.0094312   .0043732
       urate |         49    .1126207    .0427328   .0427217   .2178444
     urateus |         49    .1127294           0   .1127294   .1127294
   bartik15r |         49   -.0003358     .006606  -.0213453   .0137558
oilshock151r |         49    .0000286    .0014413  -.0006546   .0060867
-------------+---------------------------------------------------------
oilsho~1512r |         49    3.10e-06     .000156  -.0000709    .000659
        rruc |         49   -.0043146    .0129501  -.0319167   .0271667
      rurate |         49   -.0001088    .0427328  -.0700077    .105115

------------------------------------------------------------------------------------------------------------------
-> year = 1981

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1981           0       1981       1981
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0711446    .0164743   .0411667   .1266667
      ee_rst |         49      1840.4    1956.997      201.3     9916.3
    c1ee_rst |         49    .0018876    .0215844  -.0372234   .0517928
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0246933           0  -.0246933  -.0246933
 p90c1ee_rst |         49    .0354005           0   .0354005   .0354005
  p9010c1emp |         49    .0600938           0   .0600938   .0600938
        ur12 |         49    .0745833           0   .0745833   .0745833
        eeus |         49       91202           0      91202      91202
-------------+---------------------------------------------------------
       eetus |         49    89829.23           0   89829.23   89829.23
     eet_rst |         49    1810.859    1927.679    189.532   9692.084
       gapus |         49    .0151664           0   .0151664   .0151664
         gap |         49    .0207464    .0225498  -.0136621   .1082476
      urated |         49    .0152453    .0193674  -.0206079    .057886
-------------+---------------------------------------------------------
    uratedus |         49    .0118791           0   .0118791   .0118791
        rgap |         49    .0055801    .0225498  -.0288285   .0930812
       rgapx |         49    .0037226    .0075011  -.0078103    .020616
        gapx |         49     .018889    .0075011   .0073561   .0357824
       rrucx |         49   -.0032119    .0026731  -.0094206   .0028098
-------------+---------------------------------------------------------
    ruratedx |         49    .0039578    .0037285  -.0025621   .0107245
       urate |         49    .1472291    .0493686   .0529647    .251793
     urateus |         49    .1402237           0   .1402237   .1402237
   bartik15r |         49    .0001117    .0041871  -.0072307     .01223
oilshock151r |         49    .0000744    .0037046  -.0017066   .0152976
-------------+---------------------------------------------------------
oilsho~1512r |         49    .0000193    .0009597  -.0004421   .0039629
        rruc |         49   -.0034388    .0164743  -.0334167   .0520833
      rurate |         49    .0070055    .0493686  -.0872589   .1115693

------------------------------------------------------------------------------------------------------------------
-> year = 1982

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1982           0       1982       1982
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0764813    .0194645   .0405833   .1309167
      ee_rst |         49    1821.822    1954.812      201.3     9847.9
    c1ee_rst |         49   -.0127236    .0242756  -.0623959   .0533911
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    -.039707           0   -.039707   -.039707
 p90c1ee_rst |         49    .0165021           0   .0165021   .0165021
  p9010c1emp |         49    .0562091           0   .0562091   .0562091
        ur12 |         49    .0796667           0   .0796667   .0796667
        eeus |         49       90422           0      90422      90422
-------------+---------------------------------------------------------
       eetus |         49    91548.31           0   91548.31   91548.31
     eet_rst |         49      1845.5    1966.666   192.8956   9955.976
       gapus |         49   -.0123792           0  -.0123792  -.0123792
         gap |         49   -.0117985    .0345566  -.0601734   .1108117
      urated |         49    .0060639    .0156948  -.0287249   .0476377
-------------+---------------------------------------------------------
    uratedus |         49    .0039312           0   .0039312   .0039312
        rgap |         49    .0005808    .0345566  -.0477941    .123191
       rgapx |         49   -.0011722    .0078115  -.0138679   .0211257
        gapx |         49   -.0135515    .0078115  -.0262471   .0087465
       rrucx |         49   -.0027989    .0035776  -.0111788   .0036444
-------------+---------------------------------------------------------
    ruratedx |         49    .0027624    .0025292   -.003096   .0075519
       urate |         49     .137179    .0437228   .0381983   .2271292
     urateus |         49    .1307197           0   .1307197   .1307197
   bartik15r |         49   -.0004194    .0061786  -.0128179   .0172427
oilshock151r |         49     .000092     .004514  -.0021125   .0183512
-------------+---------------------------------------------------------
oilsho~1512r |         49    .0000257    .0012636  -.0005914    .005137
        rruc |         49   -.0031854    .0194645  -.0390833     .05125
      rurate |         49    .0064593    .0437228  -.0925214   .0964094

------------------------------------------------------------------------------------------------------------------
-> year = 1983

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1983           0       1983       1983
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0964014    .0235224   .0570833     .15925
      ee_rst |         49    1796.116    1926.981      198.5     9751.2
    c1ee_rst |         49   -.0136515    .0209071  -.0788863   .0151474
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0325737           0  -.0325737  -.0325737
 p90c1ee_rst |         49    .0087675           0   .0087675   .0087675
  p9010c1emp |         49    .0413412           0   .0413412   .0413412
        ur12 |         49    .1009167           0   .1009167   .1009167
        eeus |         49       89076           0      89076      89076
-------------+---------------------------------------------------------
       eetus |         49    93308.41           0   93308.41   93308.41
     eet_rst |         49    1880.793    2006.197   194.7152   10217.13
       gapus |         49   -.0464203           0  -.0464203  -.0464203
         gap |         49   -.0448665    .0234834  -.0901835   .0198694
      urated |         49    .0467361    .0213701  -.0005823   .1066983
-------------+---------------------------------------------------------
    uratedus |         49     .041309           0    .041309    .041309
        rgap |         49    .0015538    .0234834  -.0437632   .0662897
       rgapx |         49    .0004718    .0045292  -.0056694   .0130915
        gapx |         49   -.0459485    .0045292  -.0520897  -.0333288
       rrucx |         49   -.0044235    .0043844  -.0136253   .0042333
-------------+---------------------------------------------------------
    ruratedx |         49    .0056046     .004301  -.0054071   .0123449
       urate |         49    .1758098     .047129   .0809651   .2731428
     urateus |         49    .1656212           0   .1656212   .1656212
   bartik15r |         49   -6.47e-07    .0049686  -.0200723   .0079742
oilshock151r |         49   -.0000404    .0019803  -.0077793   .0009364
-------------+---------------------------------------------------------
oilsho~1512r |         49    4.51e-06    .0002207  -.0001044   .0008672
        rruc |         49   -.0045153    .0235224  -.0438333   .0583333
      rurate |         49    .0101885     .047129  -.0846561   .1075216

------------------------------------------------------------------------------------------------------------------
-> year = 1984

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1984           0       1984       1984
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0856769    .0236502     .04925   .1665833
      ee_rst |         49    1884.461    2011.701      194.6    10210.6
    c1ee_rst |         49    .0489771    .0205114  -.0196473   .1046423
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0244177           0   .0244177   .0244177
 p90c1ee_rst |         49     .073681           0    .073681    .073681
  p9010c1emp |         49    .0492633           0   .0492633   .0492633
        ur12 |         49      .08975    1.40e-17     .08975     .08975
        eeus |         49       93411           0      93411      93411
-------------+---------------------------------------------------------
       eetus |         49    95148.59           0   95148.59   95148.59
     eet_rst |         49    1917.557    2046.619   195.3354   10479.19
       gapus |         49   -.0184307           0  -.0184307  -.0184307
         gap |         49   -.0165979    .0169667   -.045832   .0252813
      urated |         49    .0078797    .0162715  -.0337847   .0778929
-------------+---------------------------------------------------------
    uratedus |         49     .004901           0    .004901    .004901
        rgap |         49    .0018328    .0169667  -.0274013    .043712
       rgapx |         49    .0009566     .003105   -.004479   .0096962
        gapx |         49   -.0174741     .003105  -.0229097  -.0087345
       rrucx |         49   -.0040315    .0048703  -.0153517   .0046439
-------------+---------------------------------------------------------
    ruratedx |         49    .0025084    .0038785  -.0051516   .0147734
       urate |         49    .1336476    .0338725   .0597913   .2214124
     urateus |         49     .125776           0    .125776    .125776
   bartik15r |         49    .0002287    .0034476  -.0100935   .0100526
oilshock151r |         49    -.000033     .001608  -.0061332   .0007704
-------------+---------------------------------------------------------
oilsho~1512r |         49    2.83e-06     .000138  -.0000661   .0005262
        rruc |         49   -.0040731    .0236502     -.0405   .0768333
      rurate |         49    .0078716    .0338725  -.0659847   .0956364

------------------------------------------------------------------------------------------------------------------
-> year = 1985

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1985           0       1985       1985
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0714439    .0207898     .04275   .1451667
      ee_rst |         49    1949.686    2087.032        196    10631.4
    c1ee_rst |         49    .0314927    .0178554  -.0044607   .0872374
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0036071           0   .0036071   .0036071
 p90c1ee_rst |         49    .0547988           0   .0547988   .0547988
  p9010c1emp |         49    .0511917           0   .0511917   .0511917
        ur12 |         49       .0735           0      .0735      .0735
        eeus |         49       96823           0      96823      96823
-------------+---------------------------------------------------------
       eetus |         49    97065.57           0   97065.57   97065.57
     eet_rst |         49    1955.763    2087.491    195.139   10741.13
       gapus |         49   -.0025022           0  -.0025022  -.0025022
         gap |         49   -.0054993    .0172273  -.0369339     .03256
      urated |         49   -.0127351     .009077  -.0393803   .0074241
-------------+---------------------------------------------------------
    uratedus |         49   -.0138965           0  -.0138965  -.0138965
        rgap |         49   -.0029971    .0172273  -.0344317   .0350622
       rgapx |         49   -.0032557    .0028051  -.0075955   .0041444
        gapx |         49   -.0057579    .0028051  -.0100977   .0016423
       rrucx |         49   -.0022994    .0047108  -.0135216    .004731
-------------+---------------------------------------------------------
    ruratedx |         49     .000785    .0018942  -.0045175   .0047942
       urate |         49    .1088393    .0304869   .0515956    .179183
     urateus |         49    .1029531           0   .1029531   .1029531
   bartik15r |         49   -.0001615     .003931  -.0095455   .0081028
oilshock151r |         49   -.0000148    .0007936  -.0031106   .0003598
-------------+---------------------------------------------------------
oilsho~1512r |         49    6.07e-07    .0000325  -.0000147   .0001273
        rruc |         49   -.0020561    .0207898    -.03075   .0716667
      rurate |         49    .0058862    .0304869  -.0513575   .0762299

------------------------------------------------------------------------------------------------------------------
-> year = 1986

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1986           0       1986       1986
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0699048    .0198863     .03425   .1291667
      ee_rst |         49    1990.641    2132.648      197.1    10931.6
    c1ee_rst |         49    .0199368    .0192164  -.0304801   .0563349
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0040733           0  -.0040733  -.0040733
 p90c1ee_rst |         49    .0423806           0   .0423806   .0423806
  p9010c1emp |         49     .046454           0    .046454    .046454
        ur12 |         49    .0714167           0   .0714167   .0714167
        eeus |         49       98910           0      98910      98910
-------------+---------------------------------------------------------
       eetus |         49    99038.67           0   99038.67   99038.67
     eet_rst |         49     1995.05     2128.04   194.5011   10999.23
       gapus |         49   -.0013001           0  -.0013001  -.0013001
         gap |         49   -.0060761    .0189144  -.0416782   .0407211
      urated |         49   -.0040273    .0108294  -.0345272   .0188168
-------------+---------------------------------------------------------
    uratedus |         49   -.0045847           0  -.0045847  -.0045847
        rgap |         49    -.004776    .0189144  -.0403781   .0420211
       rgapx |         49   -.0042642    .0055013  -.0126094   .0094729
        gapx |         49   -.0055642    .0055013  -.0139094   .0081728
       rrucx |         49     -.00218    .0056347  -.0158243   .0041425
-------------+---------------------------------------------------------
    ruratedx |         49   -.0001508    .0032828  -.0074321   .0045491
       urate |         49    .1129202      .02942   .0527652   .1720287
     urateus |         49    .1080727           0   .1080727   .1080727
   bartik15r |         49   -.0004704    .0055819  -.0183775     .01054
oilshock151r |         49   -.0000267    .0014221  -.0056539   .0006518
-------------+---------------------------------------------------------
oilsho~1512r |         49    1.95e-06    .0001038  -.0000476   .0004127
        rruc |         49   -.0015119    .0198863  -.0371667     .05775
      rurate |         49    .0048475      .02942  -.0553075    .063956

------------------------------------------------------------------------------------------------------------------
-> year = 1987

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1987           0       1987       1987
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0681003    .0219769   .0231667       .126
      ee_rst |         49    2036.053     2183.52      174.7    11317.3
    c1ee_rst |         49    .0195156    .0301398  -.1136479    .060938
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0103588           0  -.0103588  -.0103588
 p90c1ee_rst |         49    .0507244           0   .0507244   .0507244
  p9010c1emp |         49    .0610832           0   .0610832   .0610832
        ur12 |         49    .0689167           0   .0689167   .0689167
        eeus |         49      101136           0     101136     101136
-------------+---------------------------------------------------------
       eetus |         49    101044.8           0   101044.8   101044.8
     eet_rst |         49    2034.997    2167.497   193.8056    11248.7
       gapus |         49    .0009018           0   .0009018   .0009018
         gap |         49   -.0076487    .0301549  -.1037854   .0579831
      urated |         49   -.0011383    .0200499  -.0341725   .0674631
-------------+---------------------------------------------------------
    uratedus |         49   -.0028735           0  -.0028735  -.0028735
        rgap |         49   -.0085505    .0301549  -.1046872   .0570813
       rgapx |         49    -.006514    .0119313  -.0282374   .0183585
        gapx |         49   -.0056121    .0119313  -.0273356   .0192603
       rrucx |         49   -.0019353    .0068984   -.018206   .0061072
-------------+---------------------------------------------------------
    ruratedx |         49    .0004314    .0065317  -.0135247   .0155229
       urate |         49    .1110768    .0337047   .0477436   .1922939
     urateus |         49    .1057077           0   .1057077   .1057077
   bartik15r |         49   -2.66e-06    .0027816   -.007775   .0075035
oilshock151r |         49    .0001341    .0100719  -.0402744   .0049673
-------------+---------------------------------------------------------
oilsho~1512r |         49   -.0000749    .0056275  -.0027754   .0225025
        rruc |         49   -.0008163    .0219769    -.04575   .0570833
      rurate |         49    .0053691    .0337047  -.0579641   .0865863

------------------------------------------------------------------------------------------------------------------
-> year = 1988

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1988           0       1988       1988
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0590221    .0197097     .02275   .1146667
      ee_rst |         49    2104.512    2253.354      180.1    11768.1
    c1ee_rst |         49     .035208    .0119523   .0149609   .0752532
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0203989           0   .0203989   .0203989
 p90c1ee_rst |         49    .0492487           0   .0492487   .0492487
  p9010c1emp |         49    .0288498           0   .0288498   .0288498
        ur12 |         49       .0595           0      .0595      .0595
        eeus |         49      104456           0     104456     104456
-------------+---------------------------------------------------------
       eetus |         49    103059.7           0   103059.7   103059.7
     eet_rst |         49    2075.139    2205.151   193.4623   11484.04
       gapus |         49    .0134578           0   .0134578   .0134578
         gap |         49    .0062476    .0309496  -.0715704   .0738117
      urated |         49   -.0158001    .0134898  -.0431759   .0150225
-------------+---------------------------------------------------------
    uratedus |         49   -.0163124           0  -.0163124  -.0163124
        rgap |         49   -.0072102    .0309496  -.0850282   .0603539
       rgapx |         49   -.0045823    .0133408  -.0257707   .0226168
        gapx |         49    .0088754    .0133408   -.012313   .0360745
       rrucx |         49   -.0015651    .0064039  -.0162926   .0062761
-------------+---------------------------------------------------------
    ruratedx |         49   -.0005824     .005027  -.0122184   .0075426
       urate |         49    .0918643    .0262835   .0396472   .1631896
     urateus |         49    .0885451           0   .0885451   .0885451
   bartik15r |         49   -6.78e-06    .0072666  -.0282066   .0142551
oilshock151r |         49   -.0000399      .00233  -.0010948   .0093348
-------------+---------------------------------------------------------
oilsho~1512r |         49   -5.65e-06    .0003302  -.0001552   .0013229
        rruc |         49   -.0004779    .0197097    -.03675   .0551667
      rurate |         49    .0033192    .0262835  -.0488979   .0746445

------------------------------------------------------------------------------------------------------------------
-> year = 1989

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1989           0       1989       1989
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0529286    .0169082   .0254167   .1000833
      ee_rst |         49    2164.265    2312.969      183.8      12152
    c1ee_rst |         49    .0305679     .013604   .0030777   .0807537
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0131632           0   .0131632   .0131632
 p90c1ee_rst |         49    .0463497           0   .0463497   .0463497
  p9010c1emp |         49    .0331865           0   .0331865   .0331865
        ur12 |         49    .0536667    7.01e-18   .0536667   .0536667
        eeus |         49      107583           0     107583     107583
-------------+---------------------------------------------------------
       eetus |         49    105059.7           0   105059.7   105059.7
     eet_rst |         49    2115.022    2240.462     193.69   11700.47
       gapus |         49    .0237336           0   .0237336   .0237336
         gap |         49    .0156276    .0303878  -.0524108   .0737933
      urated |         49   -.0200643    .0097853  -.0429773  -.0012011
-------------+---------------------------------------------------------
    uratedus |         49   -.0200052           0  -.0200052  -.0200052
        rgap |         49    -.008106    .0303878  -.0761444   .0500596
       rgapx |         49   -.0055302     .012981  -.0257843   .0203312
        gapx |         49    .0182034     .012981  -.0020507   .0440649
       rrucx |         49   -.0016349    .0052918  -.0138888   .0055393
-------------+---------------------------------------------------------
    ruratedx |         49   -.0005844    .0032539  -.0096604    .005312
       urate |         49    .0835068    .0225325   .0387705   .1415384
     urateus |         49    .0816894           0   .0816894   .0816894
   bartik15r |         49    .0000487    .0026212   -.004767   .0073145
oilshock151r |         49    .0000683    .0033641  -.0134842    .001601
-------------+---------------------------------------------------------
oilsho~1512r |         49   -.0000152     .000749  -.0003564    .003002
        rruc |         49   -.0007381    .0169082    -.02825   .0464167
      rurate |         49    .0018174    .0225325  -.0429189    .059849

------------------------------------------------------------------------------------------------------------------
-> year = 1990

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1990           0       1990       1990
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49     .051602    .0118957   .0271667   .0846667
      ee_rst |         49    2205.751    2353.946      190.2    12437.2
    c1ee_rst |         49    .0221743    .0217237  -.0371903   .0788117
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0091843           0  -.0091843  -.0091843
 p90c1ee_rst |         49    .0475623           0   .0475623   .0475623
  p9010c1emp |         49    .0567466           0   .0567466   .0567466
        ur12 |         49    .0528333           0   .0528333   .0528333
        eeus |         49      109611           0     109611     109611
-------------+---------------------------------------------------------
       eetus |         49    107035.5           0   107035.5   107035.5
     eet_rst |         49    2154.484    2273.379   194.5739   11896.02
       gapus |         49    .0237771           0   .0237771   .0237771
         gap |         49    .0167979    .0213781  -.0232404   .0555969
      urated |         49    -.014837    .0070285  -.0294739   .0066899
-------------+---------------------------------------------------------
    uratedus |         49   -.0136174           0  -.0136174  -.0136174
        rgap |         49   -.0069792    .0213781  -.0470176   .0318198
       rgapx |         49   -.0053487    .0077339   -.018019   .0090586
        gapx |         49    .0184284    .0077339   .0057581   .0328357
       rrucx |         49   -.0017111    .0026609  -.0074965   .0030017
-------------+---------------------------------------------------------
    ruratedx |         49   -.0011232    .0012508  -.0043091   .0032208
       urate |         49    .0852163    .0225709    .042271   .1293123
     urateus |         49    .0855196           0   .0855196   .0855196
   bartik15r |         49    .0000219    .0028647  -.0063721   .0096645
oilshock151r |         49   -.0000493    .0020366  -.0009865   .0082873
-------------+---------------------------------------------------------
oilsho~1512r |         49   -7.34e-06    .0003035   -.000147   .0012349
        rruc |         49   -.0012313    .0118957  -.0256667   .0318333
      rurate |         49   -.0003033    .0225709  -.0432486   .0437926

------------------------------------------------------------------------------------------------------------------
-> year = 1991

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1991           0       1991       1991
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49     .057483    .0113583     .02375     .09125
      ee_rst |         49     2180.79    2323.616      195.3    12360.2
    c1ee_rst |         49   -.0062206    .0262187  -.0648863   .0392878
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0456899           0  -.0456899  -.0456899
 p90c1ee_rst |         49    .0250659           0   .0250659   .0250659
  p9010c1emp |         49    .0707558           0   .0707558   .0707558
        ur12 |         49    .0594167           0   .0594167   .0594167
        eeus |         49      108535           0     108535     108535
-------------+---------------------------------------------------------
       eetus |         49    109002.8           0   109002.8   109002.8
     eet_rst |         49    2193.857    2304.575   196.1002   12073.25
       gapus |         49   -.0043004           0  -.0043004  -.0043004
         gap |         49     -.01027    .0156036   -.057451   .0284993
      urated |         49    .0005742    .0146606  -.0276291   .0429511
-------------+---------------------------------------------------------
    uratedus |         49    .0021395           0   .0021395   .0021395
        rgap |         49   -.0059696    .0156036  -.0531506   .0327997
       rgapx |         49   -.0058388    .0037044  -.0143434   .0049034
        gapx |         49   -.0101392    .0037044  -.0186438    .000603
       rrucx |         49   -.0017983    .0018013   -.005082   .0012692
-------------+---------------------------------------------------------
    ruratedx |         49   -.0006999    .0049401  -.0082462   .0110668
       urate |         49    .0976024    .0306652   .0353688   .1786962
     urateus |         49    .0991695           0   .0991695   .0991695
   bartik15r |         49    7.16e-06    .0027497  -.0055323   .0068284
oilshock151r |         49   -.0000698    .0024321  -.0011889   .0099353
-------------+---------------------------------------------------------
oilsho~1512r |         49   -.0000137    .0004777  -.0002335   .0019515
        rruc |         49   -.0019337    .0113583  -.0356667   .0318333
      rurate |         49   -.0015671    .0306652  -.0638006   .0795267

------------------------------------------------------------------------------------------------------------------
-> year = 1992

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1992           0       1992       1992
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0660527    .0148391     .02725   .1090833
      ee_rst |         49    2180.671    2294.223      197.5    12174.1
    c1ee_rst |         49    .0069873    .0180938  -.0281976   .0499829
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0200614           0  -.0200614  -.0200614
 p90c1ee_rst |         49    .0262442           0   .0262442   .0262442
  p9010c1emp |         49    .0463056           0   .0463056   .0463056
        ur12 |         49    .0704167           0   .0704167   .0704167
        eeus |         49      108296           0     108296     108296
-------------+---------------------------------------------------------
       eetus |         49    111002.9           0   111002.9   111002.9
     eet_rst |         49    2233.986    2335.519   198.2115   12240.14
       gapus |         49   -.0246885           0  -.0246885  -.0246885
         gap |         49   -.0241094    .0178639  -.0737177   .0214764
      urated |         49    .0215179    .0169153  -.0114364   .0639594
-------------+---------------------------------------------------------
    uratedus |         49    .0235737           0   .0235737   .0235737
        rgap |         49    .0005791    .0178639  -.0490292   .0461649
       rgapx |         49    .0003099    .0052781  -.0138578   .0080247
        gapx |         49   -.0243787    .0052781  -.0385463  -.0166638
       rrucx |         49   -.0039833    .0036595  -.0098938   .0028776
-------------+---------------------------------------------------------
    ruratedx |         49   -.0010842    .0069086  -.0112506   .0167647
       urate |         49    .1157822    .0359593   .0406278   .2150494
     urateus |         49    .1186556           0   .1186556   .1186556
   bartik15r |         49    .0001099     .002285  -.0060997   .0056709
oilshock151r |         49    .0000487    .0016489  -.0065238   .0008557
-------------+---------------------------------------------------------
oilsho~1512r |         49   -6.73e-06     .000228  -.0001183   .0009022
        rruc |         49   -.0043639    .0148391  -.0431667   .0386667
      rurate |         49   -.0028734    .0359593  -.0780279   .0963938

------------------------------------------------------------------------------------------------------------------
-> year = 1993

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1993           0       1993       1993
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49     .067818    .0153061   .0290833      .1115
      ee_rst |         49    2214.314    2294.081      200.2    12007.1
    c1ee_rst |         49    .0213065    .0130163  -.0137176   .0469726
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0027272           0   .0027272   .0027272
 p90c1ee_rst |         49    .0385956           0   .0385956   .0385956
  p9010c1emp |         49    .0358684           0   .0358684   .0358684
        ur12 |         49    .0743333           0   .0743333   .0743333
        eeus |         49      109916           0     109916     109916
-------------+---------------------------------------------------------
       eetus |         49    113072.9           0   113072.9   113072.9
     eet_rst |         49    2275.585    2367.842   200.8422   12407.52
       gapus |         49   -.0283164           0  -.0283164  -.0283164
         gap |         49   -.0240212    .0167253  -.0623372   .0248939
      urated |         49    .0126403     .009228  -.0039167   .0328837
-------------+---------------------------------------------------------
    uratedus |         49    .0155968           0   .0155968   .0155968
        rgap |         49    .0042953    .0167253  -.0340207   .0532103
       rgapx |         49    .0042195    .0046757  -.0085828   .0123717
        gapx |         49    -.024097    .0046757  -.0368992  -.0159447
       rrucx |         49   -.0062673    .0036554  -.0124204   .0008129
-------------+---------------------------------------------------------
    ruratedx |         49   -.0025534    .0031884  -.0069777   .0063171
       urate |         49    .1041771    .0304682   .0404523    .191548
     urateus |         49    .1086197           0   .1086197   .1086197
   bartik15r |         49    .0000201    .0020401  -.0053482   .0039904
oilshock151r |         49    .0000252    .0007931  -.0030833   .0004114
-------------+---------------------------------------------------------
oilsho~1512r |         49   -1.77e-06    .0000556  -.0000289   .0002163
        rruc |         49   -.0065153    .0153061    -.04525   .0371667
      rurate |         49   -.0044427    .0304682  -.0681674   .0829283

------------------------------------------------------------------------------------------------------------------
-> year = 1994

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1994           0       1994       1994
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0614405    .0141027   .0274167     .10175
      ee_rst |         49    2275.682    2329.762      206.8    12089.2
    c1ee_rst |         49    .0331013    .0187741  -.0219076    .096319
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0124725           0   .0124725   .0124725
 p90c1ee_rst |         49    .0587515           0   .0587515   .0587515
  p9010c1emp |         49     .046279           0    .046279    .046279
        ur12 |         49    .0676667           0   .0676667   .0676667
        eeus |         49      113137           0     113137     113137
-------------+---------------------------------------------------------
       eetus |         49    115222.4           0   115222.4   115222.4
     eet_rst |         49    2318.832    2402.731   203.9197   12585.57
       gapus |         49   -.0182646           0  -.0182646  -.0182646
         gap |         49   -.0126864    .0152004  -.0443054   .0162963
      urated |         49    -.002176    .0076525   -.027053   .0166321
-------------+---------------------------------------------------------
    uratedus |         49   -.0000385           0  -.0000385  -.0000385
        rgap |         49    .0055782    .0152004  -.0260408   .0345609
       rgapx |         49    .0051765    .0049203  -.0080098    .012354
        gapx |         49   -.0130882    .0049203  -.0262744  -.0059106
       rrucx |         49    -.006178    .0026379  -.0109759  -.0006499
-------------+---------------------------------------------------------
    ruratedx |         49     -.00208    .0012129  -.0038736   .0012037
       urate |         49     .086659    .0270621    .034794   .1510095
     urateus |         49    .0907804           0   .0907804   .0907804
   bartik15r |         49    .0002403    .0031178  -.0130325   .0063871
oilshock151r |         49    .0000499    .0014718  -.0056146   .0007612
-------------+---------------------------------------------------------
oilsho~1512r |         49   -6.83e-06    .0002012  -.0001041   .0007677
        rruc |         49   -.0062262    .0141027    -.04025   .0340833
      rurate |         49   -.0041214    .0270621  -.0559864   .0602291

------------------------------------------------------------------------------------------------------------------
-> year = 1995

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1995           0       1995       1995
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0532585    .0122468   .0250833      .0825
      ee_rst |         49    2347.508    2386.295      211.9    12314.1
    c1ee_rst |         49    .0343731    .0149044  -.0220936   .0775042
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0188993           0   .0188993   .0188993
 p90c1ee_rst |         49    .0503106           0   .0503106   .0503106
  p9010c1emp |         49    .0314113           0   .0314113   .0314113
        ur12 |         49      .05825    7.01e-18     .05825     .05825
        eeus |         49      116809           0     116809     116809
-------------+---------------------------------------------------------
       eetus |         49    117429.6           0   117429.6   117429.6
     eet_rst |         49    2363.297    2440.604   207.3652   12780.47
       gapus |         49   -.0052985           0  -.0052985  -.0052985
         gap |         49    .0001063    .0148643  -.0371737   .0267422
      urated |         49   -.0014339    .0092123  -.0206823   .0316273
-------------+---------------------------------------------------------
    uratedus |         49      .00015           0     .00015     .00015
        rgap |         49    .0054048    .0148643  -.0318752   .0320407
       rgapx |         49    .0048015    .0051856  -.0060578   .0121847
        gapx |         49    -.000497    .0051856  -.0113562   .0068862
       rrucx |         49   -.0050743    .0023633  -.0092999   .0010612
-------------+---------------------------------------------------------
    ruratedx |         49   -.0015082    .0020309  -.0045801   .0035152
       urate |         49    .0848414    .0302941    .031938   .1746655
     urateus |         49    .0887414           0   .0887414   .0887414
   bartik15r |         49    .0001836    .0031435  -.0153396   .0042016
oilshock151r |         49    .0000162    .0005497   -.002394   .0002855
-------------+---------------------------------------------------------
oilsho~1512r |         49   -1.60e-06    .0000544  -.0000283   .0002369
        rruc |         49   -.0049915    .0122468  -.0331667     .02425
      rurate |         49   -.0038999    .0302941  -.0568033   .0859242

------------------------------------------------------------------------------------------------------------------
-> year = 1996

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1996           0       1996       1996
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0519983     .012317   .0270833   .0874167
      ee_rst |         49     2392.99    2434.482      212.1    12635.5
    c1ee_rst |         49    .0192963    .0144605  -.0191648   .0628408
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0021717           0   .0021717   .0021717
 p90c1ee_rst |         49    .0362765           0   .0362765   .0362765
  p9010c1emp |         49    .0341048           0   .0341048   .0341048
        ur12 |         49    .0560833           0   .0560833   .0560833
        eeus |         49      118885           0     118885     118885
-------------+---------------------------------------------------------
       eetus |         49    119651.7           0   119651.7   119651.7
     eet_rst |         49    2408.115    2481.129   211.1282   12993.44
       gapus |         49   -.0064286           0  -.0064286  -.0064286
         gap |         49   -.0012026    .0138373  -.0279343   .0220069
      urated |         49    .0003334    .0058076  -.0100839   .0174127
-------------+---------------------------------------------------------
    uratedus |         49    .0005671           0   .0005671   .0005671
        rgap |         49     .005226    .0138373  -.0215057   .0284355
       rgapx |         49    .0042812    .0055456  -.0062537   .0103117
        gapx |         49   -.0021474    .0055456  -.0126823   .0038831
       rrucx |         49   -.0040065    .0024705  -.0080782   .0043012
-------------+---------------------------------------------------------
    ruratedx |         49   -.0001481     .001451  -.0017548   .0038273
       urate |         49    .0842854    .0296193   .0337309   .1721587
     urateus |         49    .0870291           0   .0870291   .0870291
   bartik15r |         49    .0001096    .0024544  -.0058052   .0035319
oilshock151r |         49   -6.66e-06    .0002412  -.0001264   .0010464
-------------+---------------------------------------------------------
oilsho~1512r |         49   -3.01e-07    .0000109  -5.72e-06   .0000473
        rruc |         49    -.004085     .012317      -.029   .0313333
      rurate |         49   -.0027437    .0296193  -.0532982   .0851296

------------------------------------------------------------------------------------------------------------------
-> year = 1997

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1997           0       1997       1997
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0501293    .0116477   .0270833   .0848333
      ee_rst |         49    2453.341    2499.769      214.7    12988.8
    c1ee_rst |         49    .0239945    .0132745  -.0206513   .0707305
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0124019           0   .0124019   .0124019
 p90c1ee_rst |         49    .0398566           0   .0398566   .0398566
  p9010c1emp |         49    .0274547           0   .0274547   .0274547
        ur12 |         49    .0533333           0   .0533333   .0533333
        eeus |         49      121844           0     121844     121844
-------------+---------------------------------------------------------
       eetus |         49      121840           0     121840     121840
     eet_rst |         49    2452.266    2523.416    215.204   13221.01
       gapus |         49    .0000326           0   .0000326   .0000326
         gap |         49    .0030494    .0127711  -.0390965   .0341117
      urated |         49    .0007847    .0046543  -.0080473   .0125846
-------------+---------------------------------------------------------
    uratedus |         49    -.000173           0   -.000173   -.000173
        rgap |         49    .0030169    .0127711  -.0391291   .0340791
       rgapx |         49    .0020312    .0048069  -.0097397   .0100428
        gapx |         49    .0020638    .0048069  -.0097071   .0100754
       rrucx |         49   -.0032481    .0020611  -.0066274    .004276
-------------+---------------------------------------------------------
    ruratedx |         49    .0010464    .0008588  -.0007546   .0037876
       urate |         49    .0827301    .0284391   .0363561   .1633662
     urateus |         49    .0843803           0   .0843803   .0843803
   bartik15r |         49    .0001316    .0021626  -.0075197   .0031977
oilshock151r |         49   -.0000233    .0009224  -.0004877   .0039968
-------------+---------------------------------------------------------
oilsho~1512r |         49   -4.22e-06    .0001669  -.0000882   .0007232
        rruc |         49   -.0032041    .0116477    -.02625      .0315
      rurate |         49   -.0016503    .0284391  -.0480243   .0789859

------------------------------------------------------------------------------------------------------------------
-> year = 1998

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1998           0       1998       1998
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0451582    .0114674   .0234167       .083
      ee_rst |         49    2518.659    2576.608      219.3    13423.6
    c1ee_rst |         49    .0253599     .009397  -.0068127     .04815
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0163448           0   .0163448   .0163448
 p90c1ee_rst |         49    .0374045           0   .0374045   .0374045
  p9010c1emp |         49    .0210598           0   .0210598   .0210598
        ur12 |         49    .0479167           0   .0479167   .0479167
        eeus |         49      124961           0     124961     124961
-------------+---------------------------------------------------------
       eetus |         49    123937.9           0   123937.9   123937.9
     eet_rst |         49    2494.575    2566.111   219.5975   13456.17
       gapus |         49     .008221           0    .008221    .008221
         gap |         49    .0099722     .012172  -.0444551   .0313248
      urated |         49   -.0063684    .0060727  -.0153166    .019241
-------------+---------------------------------------------------------
    uratedus |         49   -.0081227           0  -.0081227  -.0081227
        rgap |         49    .0017512     .012172  -.0526762   .0231038
       rgapx |         49    .0008439    .0037846  -.0126285   .0052138
        gapx |         49    .0090649    .0037846  -.0044075   .0134348
       rrucx |         49   -.0027033    .0020896  -.0059746   .0052255
-------------+---------------------------------------------------------
    ruratedx |         49    .0017094    .0008041  -.0012701   .0038615
       urate |         49    .0739703    .0255055   .0341556   .1459396
     urateus |         49    .0748716           0   .0748716   .0748716
   bartik15r |         49    .0001204    .0019681  -.0039752   .0036337
oilshock151r |         49    9.38e-06    .0004175  -.0018149   .0002214
-------------+---------------------------------------------------------
oilsho~1512r |         49   -7.98e-07    .0000355  -.0000188   .0001544
        rruc |         49   -.0027585    .0114674     -.0245   .0350833
      rurate |         49   -.0009013    .0255055   -.040716    .071068

------------------------------------------------------------------------------------------------------------------
-> year = 1999

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        1999           0       1999       1999
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0421071    .0108983     .02575   .0766667
      ee_rst |         49    2577.776    2645.876      224.4    13819.9
    c1ee_rst |         49    .0225179    .0106487   .0011433   .0690571
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0117027           0   .0117027   .0117027
 p90c1ee_rst |         49    .0333251           0   .0333251   .0333251
  p9010c1emp |         49    .0216224           0   .0216224   .0216224
        ur12 |         49    .0441667           0   .0441667   .0441667
        eeus |         49      127996           0     127996     127996
-------------+---------------------------------------------------------
       eetus |         49    125888.9           0   125888.9   125888.9
     eet_rst |         49    2533.881    2607.625   224.3083   13689.54
       gapus |         49    .0165996           0   .0165996   .0165996
         gap |         49     .015705    .0120462  -.0446684   .0296459
      urated |         49   -.0078708    .0051926  -.0250277   .0033021
-------------+---------------------------------------------------------
    uratedus |         49   -.0087735           0  -.0087735  -.0087735
        rgap |         49   -.0008946    .0120462  -.0612681   .0130463
       rgapx |         49   -.0014642    .0028855  -.0140048   .0016329
        gapx |         49    .0151354    .0028855   .0025948   .0182326
       rrucx |         49   -.0023178    .0019838  -.0059178   .0040483
-------------+---------------------------------------------------------
    ruratedx |         49    .0008106    .0008885  -.0023096   .0022473
       urate |         49    .0713524    .0250436    .031378    .136619
     urateus |         49    .0731379           0   .0731379   .0731379
   bartik15r |         49    .0000895    .0020752  -.0039859   .0044481
oilshock151r |         49    .0000434    .0021401  -.0093444   .0011394
-------------+---------------------------------------------------------
oilsho~1512r |         49   -.0000196    .0009646  -.0005136    .004212
        rruc |         49   -.0020595    .0108983  -.0184167      .0325
      rurate |         49   -.0017855    .0250436  -.0417599   .0634811

------------------------------------------------------------------------------------------------------------------
-> year = 2000

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        2000           0       2000       2000
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0397619    .0094496   .0258333   .0616667
      ee_rst |         49    2645.567    2726.664      232.2    14323.4
    c1ee_rst |         49    .0262894    .0088599   .0090075   .0448311
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0139908           0   .0139908   .0139908
 p90c1ee_rst |         49    .0387619           0   .0387619   .0387619
  p9010c1emp |         49     .024771           0    .024771    .024771
        ur12 |         49       .0415           0      .0415      .0415
        eeus |         49      131374           0     131374     131374
-------------+---------------------------------------------------------
       eetus |         49    127646.6           0   127646.6   127646.6
     eet_rst |         49    2569.263    2646.488   229.3335   13911.47
       gapus |         49    .0287829           0   .0287829   .0287829
         gap |         49    .0269226    .0092395   -.007453   .0449453
      urated |         49   -.0123057    .0053866   -.027572  -.0011846
-------------+---------------------------------------------------------
    uratedus |         49   -.0135999           0  -.0135999  -.0135999
        rgap |         49   -.0018603    .0092395  -.0362359   .0161624
       rgapx |         49    -.001989    .0014807  -.0083547   .0003652
        gapx |         49    .0267938    .0014807   .0204282   .0291481
       rrucx |         49   -.0020776    .0017428  -.0058461   .0019126
-------------+---------------------------------------------------------
    ruratedx |         49    .0011158    .0012595  -.0018403    .003548
       urate |         49    .0663208    .0224778   .0276765   .1242531
     urateus |         49    .0677504           0   .0677504   .0677504
   bartik15r |         49   -2.74e-06    .0029132  -.0057093   .0107394
oilshock151r |         49   -.0000283    .0015335  -.0008152   .0067284
-------------+---------------------------------------------------------
oilsho~1512r |         49   -9.44e-06    .0005105  -.0002714   .0022398
        rruc |         49   -.0017381    .0094496  -.0156667   .0201667
      rurate |         49   -.0014296    .0224778   -.040074   .0565027

------------------------------------------------------------------------------------------------------------------
-> year = 2001

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        2001           0       2001       2001
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0388095    .0086605     .02275       .057
      ee_rst |         49    2669.759    2779.321      236.8    14713.1
    c1ee_rst |         49    .0077459    .0135635  -.0196742   .0439745
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0096425           0  -.0096425  -.0096425
 p90c1ee_rst |         49    .0238055           0   .0238055   .0238055
  p9010c1emp |         49     .033448           0    .033448    .033448
        ur12 |         49    .0401667           0   .0401667   .0401667
        eeus |         49      132500           0     132500     132500
-------------+---------------------------------------------------------
       eetus |         49    129185.9           0   129185.9   129185.9
     eet_rst |         49    2600.238    2681.612   234.6706   14113.56
       gapus |         49    .0253304           0   .0253304   .0253304
         gap |         49     .021676    .0113029  -.0012027   .0510225
      urated |         49   -.0123705    .0062963  -.0258019  -.0016719
-------------+---------------------------------------------------------
    uratedus |         49    -.014172           0   -.014172   -.014172
        rgap |         49   -.0036544    .0113029  -.0265331   .0256921
       rgapx |         49   -.0037399    .0023337  -.0072383   .0033034
        gapx |         49    .0215905    .0023337   .0180921   .0286338
       rrucx |         49    -.001685    .0018299  -.0067522   .0018089
-------------+---------------------------------------------------------
    ruratedx |         49    .0015814    .0021851  -.0043673   .0045164
       urate |         49    .0661271    .0226945   .0275392   .1155834
     urateus |         49     .067097           0    .067097    .067097
   bartik15r |         49    -.000146    .0029244  -.0065034   .0062823
oilshock151r |         49   -.0000365    .0020929  -.0011139   .0091629
-------------+---------------------------------------------------------
oilsho~1512r |         49   -.0000172    .0009869  -.0005253   .0043209
        rruc |         49   -.0013571    .0086605  -.0174167   .0168333
      rurate |         49   -.0009699    .0226945  -.0395578   .0484864

------------------------------------------------------------------------------------------------------------------
-> year = 2002

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        2002           0       2002       2002
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0480102    .0093457   .0298333        .07
      ee_rst |         49    2625.655    2729.988      240.2    14459.1
    c1ee_rst |         49   -.0132306    .0111655  -.0299514   .0203987
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0266339           0  -.0266339  -.0266339
 p90c1ee_rst |         49    .0029821           0   .0029821   .0029821
  p9010c1emp |         49     .029616           0    .029616    .029616
        ur12 |         49    .0510833           0   .0510833   .0510833
        eeus |         49      130420           0     130420     130420
-------------+---------------------------------------------------------
       eetus |         49    130518.8           0   130518.8   130518.8
     eet_rst |         49    2627.086    2712.718   240.3462   14291.57
       gapus |         49   -.0007574           0  -.0007574  -.0007574
         gap |         49   -.0029806    .0101782  -.0256565   .0162732
      urated |         49    .0122591    .0099645  -.0058089   .0359933
-------------+---------------------------------------------------------
    uratedus |         49    .0133878           0   .0133878   .0133878
        rgap |         49   -.0022232    .0101782  -.0248991   .0170306
       rgapx |         49   -.0014177    .0035457  -.0090928   .0060052
        gapx |         49   -.0021751    .0035457  -.0098502   .0052478
       rrucx |         49   -.0034301    .0019037   -.007421   .0006826
-------------+---------------------------------------------------------
    ruratedx |         49   -.0012738    .0016865  -.0053702   .0025943
       urate |         49    .0909213     .029517   .0387266   .1623587
     urateus |         49     .094877           0    .094877    .094877
   bartik15r |         49   -.0001813    .0032186  -.0067529   .0099295
oilshock151r |         49    .0000158    .0009556  -.0041703   .0005098
-------------+---------------------------------------------------------
oilsho~1512r |         49   -3.45e-06     .000209  -.0001115   .0009123
        rruc |         49   -.0030731    .0093457    -.02125   .0189167
      rurate |         49   -.0039557     .029517  -.0561504   .0674817

------------------------------------------------------------------------------------------------------------------
-> year = 2003

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        2003           0       2003       2003
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49     .053915    .0096624       .033   .0758333
      ee_rst |         49    2611.878    2714.354        240    14380.3
    c1ee_rst |         49   -.0030548    .0103229   -.022964   .0331598
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0154631           0  -.0154631  -.0154631
 p90c1ee_rst |         49    .0112678           0   .0112678   .0112678
  p9010c1emp |         49    .0267309           0   .0267309   .0267309
        ur12 |         49      .05825    7.01e-18     .05825     .05825
        eeus |         49      129896           0     129896     129896
-------------+---------------------------------------------------------
       eetus |         49    131690.6           0   131690.6   131690.6
     eet_rst |         49    2650.784    2740.501   246.4079   14447.23
       gapus |         49   -.0137212           0  -.0137212  -.0137212
         gap |         49   -.0161885    .0097061  -.0391244   .0086076
      urated |         49     .015709    .0073631  -.0037522   .0309815
-------------+---------------------------------------------------------
    uratedus |         49    .0171212           0   .0171212   .0171212
        rgap |         49   -.0024673    .0097061  -.0254032   .0223288
       rgapx |         49   -.0017563    .0032545  -.0076143    .005204
        gapx |         49   -.0154775    .0032545  -.0213355  -.0085172
       rrucx |         49   -.0046748    .0015621  -.0078309  -.0008037
-------------+---------------------------------------------------------
    ruratedx |         49   -.0015461    .0011787   -.005494   .0016895
       urate |         49    .0945313    .0268965   .0415025    .153816
     urateus |         49    .0988123           0   .0988123   .0988123
   bartik15r |         49   -.0001385    .0032899  -.0061725   .0127166
oilshock151r |         49   -2.45e-07    .0000148  -7.89e-06   .0000642
-------------+---------------------------------------------------------
oilsho~1512r |         49   -8.55e-10    5.16e-08  -2.75e-08   2.24e-07
        rruc |         49    -.004335    .0096624    -.02525   .0175833
      rurate |         49    -.004281    .0268965  -.0573098   .0550037

------------------------------------------------------------------------------------------------------------------
-> year = 2004

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        2004           0       2004       2004
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0552602    .0100203   .0356667   .0809167
      ee_rst |         49    2630.865    2728.414      246.9    14441.7
    c1ee_rst |         49    .0102844    .0102328  -.0070705   .0468371
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0002296           0  -.0002296  -.0002296
 p90c1ee_rst |         49    .0251386           0   .0251386   .0251386
  p9010c1emp |         49    .0253681           0   .0253681   .0253681
        ur12 |         49       .0595           0      .0595      .0595
        eeus |         49      130801           0     130801     130801
-------------+---------------------------------------------------------
       eetus |         49    132745.5           0   132745.5   132745.5
     eet_rst |         49    2672.294    2765.829    252.902   14583.95
       gapus |         49   -.0147564           0  -.0147564  -.0147564
         gap |         49   -.0152922    .0108992  -.0378609   .0106469
      urated |         49    .0148631    .0069135  -.0023193   .0277624
-------------+---------------------------------------------------------
    uratedus |         49    .0161665           0   .0161665   .0161665
        rgap |         49   -.0005357    .0108992  -.0231045   .0254033
       rgapx |         49    .0002911    .0037895  -.0049967   .0089116
        gapx |         49   -.0144654    .0037895  -.0197531  -.0058448
       rrucx |         49   -.0044556    .0014237  -.0084554  -.0007982
-------------+---------------------------------------------------------
    ruratedx |         49   -.0014432    .0011412    -.00522   .0011953
       urate |         49     .093666    .0275778   .0423372    .153008
     urateus |         49    .0978552           0   .0978552   .0978552
   bartik15r |         49     .000108    .0021279  -.0048315   .0040557
oilshock151r |         49   -9.67e-06    .0006334  -.0003334   .0027511
-------------+---------------------------------------------------------
oilsho~1512r |         49   -1.44e-06    .0000942  -.0000496   .0004092
        rruc |         49   -.0042398    .0100203  -.0238333   .0214167
      rurate |         49   -.0041892    .0275778   -.055518   .0551528

------------------------------------------------------------------------------------------------------------------
-> year = 2005

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        2005           0       2005       2005
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0511071    .0096789   .0349167   .0746667
      ee_rst |         49    2673.657    2771.368        254    14674.5
    c1ee_rst |         49     .017791    .0127151  -.0031987   .0650624
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0052247           0   .0052247   .0052247
 p90c1ee_rst |         49    .0373781           0   .0373781   .0373781
  p9010c1emp |         49    .0321534           0   .0321534   .0321534
        ur12 |         49    .0544167    7.01e-18   .0544167   .0544167
        eeus |         49      132835           0     132835     132835
-------------+---------------------------------------------------------
       eetus |         49    133709.7           0   133709.7   133709.7
     eet_rst |         49    2692.187    2789.304   259.8106   14704.49
       gapus |         49   -.0065629           0  -.0065629  -.0065629
         gap |         49    -.006405    .0092636   -.024843   .0174617
      urated |         49   -.0006359    .0045806  -.0117667   .0105757
-------------+---------------------------------------------------------
    uratedus |         49   -.0001073           0  -.0001073  -.0001073
        rgap |         49     .000158    .0092636    -.01828   .0240246
       rgapx |         49    .0003958    .0019527   -.003219   .0052293
        gapx |         49   -.0061671    .0019527  -.0097819  -.0013336
       rrucx |         49   -.0032351    .0015689  -.0068438   .0004224
-------------+---------------------------------------------------------
    ruratedx |         49   -.0004956    .0007109  -.0023037   .0016044
       urate |         49    .0779497    .0235467   .0361338   .1368531
     urateus |         49      .08136           0     .08136     .08136
   bartik15r |         49    .0001311    .0025075  -.0100872   .0045825
oilshock151r |         49   -.0000122    .0008642  -.0004572    .003737
-------------+---------------------------------------------------------
oilsho~1512r |         49   -2.51e-06    .0001777   -.000094   .0007685
        rruc |         49   -.0033095    .0096789     -.0195     .02025
      rurate |         49   -.0034103    .0235467  -.0452262   .0554931

------------------------------------------------------------------------------------------------------------------
-> year = 2006

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        2006           0       2006       2006
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0476752    .0099853   .0335833   .0776667
      ee_rst |         49    2728.282    2832.367      267.5    14969.2
    c1ee_rst |         49    .0211666    .0177062  -.0471307   .0628209
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0066679           0   .0066679   .0066679
 p90c1ee_rst |         49    .0474427           0   .0474427   .0474427
  p9010c1emp |         49    .0407748           0   .0407748   .0407748
        ur12 |         49    .0494167           0   .0494167   .0494167
        eeus |         49      135705           0     135705     135705
-------------+---------------------------------------------------------
       eetus |         49      134590           0     134590     134590
     eet_rst |         49    2710.622    2811.154    267.056   14810.17
       gapus |         49    .0082502           0   .0082502   .0082502
         gap |         49    .0062923    .0131618   -.044492   .0487791
      urated |         49   -.0034304    .0220624  -.0225492    .137051
-------------+---------------------------------------------------------
    uratedus |         49   -.0056391           0  -.0056391  -.0056391
        rgap |         49   -.0019579    .0131618  -.0527422   .0405289
       rgapx |         49   -.0023454    .0020624  -.0057446   .0071932
        gapx |         49    .0059048    .0020624   .0025056   .0154433
       rrucx |         49   -.0015813    .0015261  -.0046664   .0014055
-------------+---------------------------------------------------------
    ruratedx |         49    .0021305    .0025272  -.0026559   .0118172
       urate |         49    .0748704    .0311862    .032397   .2099016
     urateus |         49    .0755346           0   .0755346   .0755346
   bartik15r |         49    .0000419    .0018879  -.0047656   .0033008
oilshock151r |         49   -.0000152    .0010902  -.0005816   .0047109
-------------+---------------------------------------------------------
oilsho~1512r |         49   -3.90e-06    .0002798  -.0001493    .001209
        rruc |         49   -.0017415    .0099853  -.0158333     .02825
      rurate |         49   -.0006642    .0311862  -.0431376    .134367

------------------------------------------------------------------------------------------------------------------
-> year = 2007

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        2007           0       2007       2007
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0436395    .0094849     .02775   .0691667
      ee_rst |         49    2764.918     2874.01      280.3    15152.2
    c1ee_rst |         49    .0144733    .0127858  -.0161954   .0478504
-------------+---------------------------------------------------------
 p10c1ee_rst |         49    .0021322           0   .0021322   .0021322
 p90c1ee_rst |         49    .0327316           0   .0327316   .0327316
  p9010c1emp |         49    .0305994           0   .0305994   .0305994
        ur12 |         49       .0455           0      .0455      .0455
        eeus |         49      137410           0     137410     137410
-------------+---------------------------------------------------------
       eetus |         49    135384.6           0   135384.6   135384.6
     eet_rst |         49    2727.573    2831.414   274.5022      14902
       gapus |         49    .0148494           0   .0148494   .0148494
         gap |         49    .0130759    .0105243  -.0067027   .0420816
      urated |         49    -.011573    .0063923  -.0303807   .0010582
-------------+---------------------------------------------------------
    uratedus |         49   -.0120845           0  -.0120845  -.0120845
        rgap |         49   -.0017734    .0105243   -.021552   .0272322
       rgapx |         49   -.0026303    .0026518  -.0070861   .0062365
        gapx |         49    .0122191    .0026518   .0077632   .0210859
       rrucx |         49   -.0015673    .0015557  -.0052042   .0011028
-------------+---------------------------------------------------------
    ruratedx |         49    .0009262    .0015088  -.0033199   .0033457
       urate |         49    .0664995    .0248653   .0244119   .1439177
     urateus |         49    .0688692           0   .0688692   .0688692
   bartik15r |         49    -.000094    .0028514  -.0054569    .007699
oilshock151r |         49   -6.21e-06    .0004878  -.0002611   .0021098
-------------+---------------------------------------------------------
oilsho~1512r |         49   -7.05e-07    .0000554  -.0000296   .0002395
        rruc |         49   -.0018605    .0094849    -.01775   .0236667
      rurate |         49   -.0023696    .0248653  -.0444572   .0750486

------------------------------------------------------------------------------------------------------------------
-> year = 2008

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        2008           0       2008       2008
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0441259    .0095371   .0279167       .072
      ee_rst |         49    2772.151    2877.124      289.8    15082.4
    c1ee_rst |         49    .0047481     .010881   -.023763   .0338923
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0080648           0  -.0080648  -.0080648
 p90c1ee_rst |         49    .0179112           0   .0179112   .0179112
  p9010c1emp |         49     .025976           0    .025976    .025976
        ur12 |         49      .04725           0     .04725     .04725
        eeus |         49      137858           0     137858     137858
-------------+---------------------------------------------------------
       eetus |         49    136102.7           0   136102.7   136102.7
     eet_rst |         49    2743.187    2850.323   282.0176   14982.61
       gapus |         49    .0128144           0   .0128144   .0128144
         gap |         49    .0107932    .0067782  -.0000452   .0272215
      urated |         49   -.0094427    .0058066  -.0338382   .0014017
-------------+---------------------------------------------------------
    uratedus |         49   -.0100226           0  -.0100226  -.0100226
        rgap |         49   -.0020212    .0067782  -.0128596   .0144071
       rgapx |         49   -.0024815    .0016586  -.0059908   .0009228
        gapx |         49    .0103329    .0016586   .0068236   .0137372
       rrucx |         49    -.002876    .0015884  -.0071144   9.79e-06
-------------+---------------------------------------------------------
    ruratedx |         49    .0008867      .00128  -.0012782   .0043709
       urate |         49     .068548    .0253036   .0253475   .1342182
     urateus |         49    .0708742           0   .0708742   .0708742
   bartik15r |         49   -.0001707    .0032496  -.0075854   .0069133
oilshock151r |         49   -2.38e-06    .0001924  -.0001028   .0008367
-------------+---------------------------------------------------------
oilsho~1512r |         49   -1.03e-07    8.36e-06  -4.46e-06   .0000363
        rruc |         49   -.0031241    .0095371  -.0193333     .02475
      rurate |         49   -.0023261    .0253036  -.0455267    .063344

------------------------------------------------------------------------------------------------------------------
-> year = 2009

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         49        2009           0       2009       2009
    statefip |         49    29.79592    15.53086          1         56
     ruc_rst |         49    .0609813    .0148956   .0344167   .0970833
      ee_rst |         49    2676.729    2777.449      289.1    14445.8
    c1ee_rst |         49   -.0311748    .0172291  -.0694221   .0065883
-------------+---------------------------------------------------------
 p10c1ee_rst |         49   -.0515888           0  -.0515888  -.0515888
 p90c1ee_rst |         49   -.0096703           0  -.0096703  -.0096703
  p9010c1emp |         49    .0419185           0   .0419185   .0419185
        ur12 |         49    .0661667           0   .0661667   .0661667
        eeus |         49      132070           0     132070     132070
-------------+---------------------------------------------------------
       eetus |         49    136773.8           0   136773.8   136773.8
     eet_rst |         49    2757.989    2868.538   289.5287    15057.1
       gapus |         49    -.034996           0   -.034996   -.034996
         gap |         49   -.0276231    .0169492  -.0725601   .0032274
      urated |         49    .0120397    .0090941  -.0190371   .0360045
-------------+---------------------------------------------------------
    uratedus |         49    .0131645           0   .0131645   .0131645
        rgap |         49    .0073729    .0169492   -.037564   .0382234
       rgapx |         49    .0080873    .0025045  -.0020051   .0124671
        gapx |         49   -.0269087    .0025046  -.0370011  -.0225289
       rrucx |         49   -.0049525    .0025841  -.0122344  -.0007704
-------------+---------------------------------------------------------
    ruratedx |         49   -.0014045     .001629  -.0041701    .004305
       urate |         49    .0900689    .0314241   .0301726   .1633781
     urateus |         49    .0941359           0   .0941359   .0941359
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |         49   -.0051854    .0148956    -.03175   .0309167
      rurate |         49    -.004067    .0314241  -.0639633   .0692421

------------------------------------------------------------------------------------------------------------------
-> year = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |          0
    statefip |          4       46.25    44.03313          2         88
     ruc_rst |          0
      ee_rst |          0
    c1ee_rst |          0
-------------+---------------------------------------------------------
 p10c1ee_rst |          0
 p90c1ee_rst |          0
  p9010c1emp |          0
        ur12 |          0
        eeus |          0
-------------+---------------------------------------------------------
       eetus |          0
     eet_rst |          0
       gapus |          0
         gap |          0
      urated |          0
-------------+---------------------------------------------------------
    uratedus |          0
        rgap |          0
       rgapx |          0
        gapx |          0
       rrucx |          0
-------------+---------------------------------------------------------
    ruratedx |          0
       urate |          0
     urateus |          0
   bartik15r |          0
oilshock151r |          0
-------------+---------------------------------------------------------
oilsho~1512r |          0
        rruc |          0
      rurate |          0


. save statecycle_ipums.dta, replace  ;
file statecycle_ipums.dta saved

. log close ;
      name:  <unnamed>
       log:  H:\Other\Tables 1-4 Public Programs and Data\tables 5 and 6\makestatecycle_ipums5.log
  log type:  text
 closed on:  10 Dec 2019, 10:11:48
------------------------------------------------------------------------------------------------------------------
